{
    "subjects": [
      {
        "subjectName": "Γραμμική Άλγεβρα",
        "semester": 1,
        "ECTS":6,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Νάκος Βασίλειος",
        "Hours": 5,
        "Description": "Το μάθημα καλύπτει βασικά και προχωρημένα θέματα της Γραμμικής Άλγεβρας, που αποτελούν απαραίτητο υπόβαθρο σε όλους τους  κλάδους των Θετικών Επιστημών. Εισαγωγικές έννοιες, Πίνακες, Συστήματα Γραμμικών Εξισώσεων, Διανυσματικοί χώροι, Γραμμικές απεικονίσεις, Γραμμικές απεικονίσεις και πίνακες, Πολυώνυμα, Ιδιοτιμές και Διαγωνισιμότητα, Κανονικές μορφές, Διαγωνοποίηση Ερμιτιανών πινάκων, Διανυσματικοί χώροι με εσωτερικό γινόμενο.",
        "id":15100114
    },
    {
        "subjectName": "Διακριτά Μαθηματικά",
        "semester": 1,
        "ECTS":7,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Χρήστος Τζάμος",
        "Hours": 6,
        "Description": "Το μάθημα συνίσταται στην παρουσίαση των εξής εννοιών: Σύνολα, προτάσεις, επαγωγή, διμελείς σχέσεις, συναρτήσεις, μεταθέσεις, συνδυασμοί, διακριτή πιθανότητα, δεσμευμένη πιθανότητα, ανεξάρτητα γεγονότα, θεώρημα Bayes, αριθμητικές συναρτήσεις, ασυμπτωτική συμπεριφορά αριθμητικών συναρτήσεων. Δίδονται φροντιστηριακές ασκήσεις για την επίλυση προβλημάτων επί της ύλης και τελική εξέταση.",
        "id": 15100010
    },
    {
        "subjectName": "Εισαγωγή στην Πληροφορική και στις Τηλεπικοινωνίες",
        "semester": 1,
        "ECTS":2,
        "Type": "Γενικής Παιδείας",
        "Kateythinsi": "-",
        "Professor": "Μαρία Ρούσσου",
        "Hours": 2,
        "Description": "Το μάθημα έχει σαν κύριο στόχο την εξοικείωση των φοιτητών με βασικές έννοιες και θεματικές ενότητες της επιστήμης της Πληροφορικής και των Τηλεπικοινωνιών όπως Μοντέλο Turing και Μοντέλο von Neumann, Αποθήκευση και Διαχείριση Δεδομένων, Θεωρία και Μοντέλα Υπολογισμού, Λειτουργικά Συστήματα, Δικτύωση και Διαδίκτυο, Τεχνολογία Λογισμικού και Ασφάλεια.",
        "id": 15100083
      },
    {
        "subjectName": "Εισαγωγή στον Προγραμματισμό",
        "semester": 1,
        "ECTS":7,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Αυγερινός Αθανάσιος",
        "Hours": 6,
        "Description": "Γενικά περί υπολογιστών και προγραμματισμού υπολογιστών. Ιστορική αναδρομή. Η δομή του υπολογιστή. Η πληροφορία στον υπολογιστή. Λογισμικό και γλώσσες προγραμματισμού. Απαιτήσεις από μια διαδικαστική γλώσσα προγραμματισμού. Εκτελέσιμα προγράμματα. Μεταγλώττιση και σύνδεση. Η γλώσσα προγραμματισμού C. Προγραμματιστικά περιβάλλοντα για την C. Ο μεταγλωττιστής gcc. Παραδείγματα απλών προγραμμάτων στην C. Χαρακτηριστικά και δυνατότητες της C.",
        "id": 15100084
      },
    {
        "subjectName": "Εργαστήριο Λογικής Σχεδίασης",
        "semester": 1,
        "ECTS":2,
        "Type": "Αυτοτελές Προαιρετικό Εργαστήριο",
        "Kateythinsi": "-",
        "Professor": "Βασιλόπουλος Διονύσης",
        "Hours": 2,
        "Description": "Το περιεχόμενο του μαθήματος αφορά τη σχεδίαση ψηφιακών κυκλωμάτων και την υλοποίησή τους σε τεχνολογία Field Programmable Gate Arrays (FPGAs) με τη χρήση των κατάλληλων εργαλείων λογισμικού της XILINX (WebPACK edition του Vivado Design Suite).Συγκεκριμένα αφορά τη σχεδίαση με τη γλώσσα περιγραφής υλικού VHDL, την δημιουργία κατάλληλων περιορισμών χρονισμού (timing constraints) και I/O (I/O constraints), την σύνθεση (synthesis) και υλοποίηση (implementation) και παραγωγή του bitstream στοχεύοντας συγκεκριμένο FPGA καθώς και την επαλήθευση της ορθής σχεδίασης (verification) σε όλα τα διαδοχικά επίπεδα σχεδίασης (πηγαίος κώδικας VHDL, post synthesis, post place & route) με προσομοίωση (simulation), την αποσφαλμάτωση (debug) καθώς και την επαλήθευση της λειτουργικότητας στο υλικό (FPGA validation) με χρήση κατάλληλης αναπτυξιακής κάρτας (development board).",
        "id": 15100482
      },
    {
        "subjectName": "Λογική Σχεδίαση",
        "semester": 1,
        "ECTS":6,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Βασίλειος Καρακώστας",
        "Hours": 4,
        "Description": "Εισαγωγή, διαχείριση πολυπλοκότητας και τεχνολογία ψηφιακών συστημάτων.Αριθμητικά συστήματα, δεκαδικοί, δυαδικοί και δεκαεξαδικοί αριθμοί, αναπαραστάσεις θετικών και αρνητικών αριθμών, και αριθμητικές πράξεις.Λογικές πύλες, ψηφιακά ολοκληρωμένα κυκλώματα και τεχνολογία CMOS.",
        "id": 15100430
      },
    {
        "subjectName": "Ανάλυση Ι",
        "semester": 2,
        "ECTS":8,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Παντελεήμων Δοδός",
        "Hours": 6,
        "Description": "Βασικές τοπολογικές έννοιες. Πραγματικοί αριθμοί, ακολουθίες, σειρές. Συναρτήσεις (όριο, συνέχεια, στοιχειώδεις συναρτήσεις). Ορισμένο ολοκλήρωμα (βασικές ιδιότητες). Παράγωγος (βασικές ιδιότητες). Αόριστο ολοκλήρωμα, γενικευμένο ολοκλήρωμα (μέθοδοι υπολογισμού). Δυναμοσειρές.",
        "id": 15100001
      },
    {
        "subjectName": "Αρχιτεκτονική Υπολογιστών Ι",
        "semester": 2,
        "ECTS":7,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Γκιζόπουλος Δημήτρης",
        "Hours": 5,
        "Description": "Εισαγωγή στην τεχνολογία των υπολογιστών, εντολές και επίπεδα αναπαράστασης, αναπαράσταση αριθμητικών και μη-αριθμητικών δεδομένων, οργάνωση τυπικού υπολογιστή, αρχιτεκτονική συνόλου εντολών (ISA), μικροαρχιτεκτονική, υπολογιστές RISC και CISC, MIPS ISA, καταχωρητές, μορφή και κωδικοποίηση εντολών, τρόποι διευθυνσιοδότησης, λειτουργίες αριθμητικές, λογικές και μεταφοράς δεδομένων, λειτουργίες ελέγχου ροής προγράμματος, υποστήριξη διαδικασιών στο υλικό, χρήση της στοίβας, βασικές έννοιες της μεταγλώττισης, αξιολόγηση και κατανόηση της απόδοσης, μέτρηση της απόδοσης, παράγοντες που επιδρούν στην απόδοση, αξιολόγηση της απόδοσης, σχεδίαση επεξεργαστή, μονάδες διαδρομής δεδομένων, σχεδίαση διαδρομής δεδομένων, σχεδίαση μονάδας ελέγχου, υλοποίηση ενός κύκλου, υλοποίηση πολλών κύκλων, μικροπρογραμματισμός.",
        "id": 15100202
      },
    {
        "subjectName": "Δομές Δεδομένων και Τεχνικές Προγραμματισμού",
        "semester": 2,
        "ECTS":7,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Κώστας Χατζηκοκολάκης/Μανόλης Κουμπαράκης",
        "Hours": 5,
        "Description": "Δείκτες και συνδεδεμένες αναπαραστάσεις στη γλώσσα προγραμματισμού C. Αναδρομή. Ενότητες και Αφαιρετικοί Τύποι Δεδομένων. Στοίβες. Ουρές. Εισαγωγή στην Ανάλυση Αλγορίθμων. Λίστες και Συμβολοσειρές. Δένδρα, σωροί, δένδρα εκφράσεων. Δένδρα δυαδικής αναζήτησης. AVL δένδρα. Δένδρα αναζήτησης m δρόμων, δένδρα 2-3, δένδρα 2-3-4. Β-δένδρα. Κόκκινα-μαύρα δένδρα. Κατακερματισμός. Σύνολα ξένα μεταξύ τους. Γράφοι και αλγόριθμοι για γράφους. Ταξινόμηση.",
        "id": 15100088
      },
    {
        "subjectName": "Εφαρμοσμένα Μαθηματικά",
        "semester": 2,
        "ECTS":6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "-",
        "Professor": "Μαρία Λουκά",
        "Hours": 4,
        "Description": "ΣΥΝΗΘΕΙΣ ΔΙΑΦΟΡΙΚΕΣ ΕΞΙΣΩΣΕΙΣ,ΔΙΑΦΟΡΙΣΙΜΕΣ ΔΙΑΝΥΣΜΑΤΙΚΕΣ ΣΥΝΑΡΤΗΣΕΙΣ, ΜΕΡΙΚΕΣ ΔΙΑΦΟΡΙΚΕΣ ΕΞΙΣΩΣΕΙΣ, ΜΙΓΑΔΙΚΗ ΑΝΑΛΥΣΗ",
        "id": 15100463
      },
    {
        "subjectName": "Ηλεκτρομαγνητισμός – Οπτική και Σύγχρονη Φυσική",
        "semester": 2,
        "ECTS": 8,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Δ. Βαρουτάς, Α. Τσίπουρας",
        "Hours": 8,
        "Description": "1. Ηλεκτρικό φορτίο και δυναμικό και ηλεκτρικό πεδίο,2. χωρητικότητα και διηλεκτρικά3. Ηλεκτρικό ρεύμα, αντίσταση και ηλεκτρεγερτική δύναμη4. Κινούμενα φορτία και μαγνητικό πεδίο,5. Αυτεπαγωγή-αμοιβαία επαγωγή6. Κυκλώματα συνεχούς ρεύματος, εναλλασσόμενο ρεύμα, κυκλώματα R-L-C7. Εξισώσεις Maxwell και βασικά μεγέθη Η/Μ, κυματική εξίσωση, διάνυσμα Poynting8. φύση και διάδοση του φωτός9. Γεωμετρική οπτική (κάτοπτρα φακοί), οπτικά όργανα,10. Συμβολή, περίθλαση και εφαρμογές11. Ειδική Θεωρία της σχετικότητας12. Η σταθερότητα της ταχύτητας του φωτός και τα Αδρανειακά συστήματα13. Συστολή Μήκους και διαστολή χρόνου14. Οι μετασχηματισμοί Lorentz15. Από τον Newton στον Plank16. Υλικά κύματα17. Η εξίσωση Schrödinger18. H Η δομή της ύλης",
        "id": 15100481
      },
    {
        "subjectName": "Ανάλυση ΙΙ",
        "semester": 3,
        "ECTS": 8,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Γιώργος Χαλικιάς",
        "Hours": 6,
        "Description": "Διανύσματα, διανυσματικές συναρτήσεις στο επίπεδο και στο χώρο. Εσωτερικό - εξωτερικό γινόμενο. Ευθείες – επίπεδα - επιφάνειες. Μήκος τόξου, μοναδιαίο εφαπτόμενο διάνυσμα. Σύστημα αναφοράς TNB. Συναρτήσεις πολλών μεταβλητών - παράγωγοι. Όριο - συνέχεια.Μερικές παράγωγοι. Αλυσιδωτή παραγώγιση, κατευθυνόμενη παράγωγος, διανύσματα κλίσεως, εφαπτόμενα επίπεδα, γραμμικοποίηση, διαφορικά. Ακρότατα, σαγματικά σημεία.Τύπος του Τaylor για συναρτήσεις πολλών μεταβλητών.Καμπυλόγραμμα συστήματα συντεταγμένων, μετρική, βαθμίδα, απόκλιση, στροβιλισμός.Πολλαπλά (διπλά, τριπλά) ολοκληρώματα, σε καρτεσιανές και άλλες συντεταγμένες. Εφαρμογές στον υπολογισμό εμβαδών, ροπών, κέντρων μάζας. Αλλαγές μεταβλητών (Ιακωβιανές ορίζουσες).Ολοκλήρωση διανυσματικών πεδίων. Επικαμπύλια και επιφανειακά ολοκληρώματα. Ανεξαρτησία από τη διαδρομή, συναρτήσεις δυναμικού και συντηρητικά πεδία. Θεωρήματα Green, Gauss, Stokes και εφαρμογές.",
        "id": 15100006
      },
    {
        "subjectName": "Αντικειμενοστραφής Προγραμματισμός",
        "semester": 3,
        "ECTS": 8,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Αναστασία Λυγίζου",
        "Hours": 6,
        "Description": "Γενικά για τον αντικειμενοστραφή προγραμματισμό και τις κλάσεις. Η γλώσσα προγραμματισμού C++. Βασικά στοιχεία, χώροι ονομάτων, υπερφόρτωση, κλάσεις, αντικείμενα, κληρονομικότητα, σύνθεση, πρότυπα, αφηρημένες κλάσεις, χειρισμός εξαιρέσεων, περιγραφή της καθιερωμένης βιβλιοθήκης, περιγραφή της STL. Σχεδιασμός και προγραμματισμός με τη C++. Γενική περιγραφή της γλώσσας Java. Άλλες γλώσσες αντικειμενοστραφούς προγραμματισμού. Θεωρητικά θέματα σχετικά με τα αντικείμενα.",
        "id": 15100429
      },
    {
        "subjectName": "Εργαστήριο Κυκλωμάτων και Συστημάτων",
        "semester": 3,
        "ECTS": 2,
        "Type": "Αυτοτελές Προαιρετικό Εργαστήριο",
        "Kateythinsi": "-",
        "Professor": "Αλέξανδρος Πίνο",
        "Hours": 2,
        "Description": "Καλύπτεται η θεωρία κυκλωμάτων με έμφαση στην ανάλυση και την επίλυση ασκήσεων, τόσο για κυκλώματα συνεχούς διέγερσης (DC), όσο και εναλλασσόμενης (AC) για τις μόνιμες και μεταβατικές καταστάσεις τους. Επίσης, παρουσιάζεται το εργαστήριο Κυκλωμάτων και Συστημάτων, καθώς και τα όργανα, ο εξοπλισμός του και η μεθοδολογία μετρήσεων. Έμφαση δίνεται στην πρακτική εξάσκηση στην κατασκευή και ανάλυση πραγματικών κυκλωμάτων και στη λήψη ορθών μετρήσεων ηλεκτρικών μεγεθών.",
        "id": 15100483
      },
    {
        "subjectName": "Πιθανότητες και Στατιστική",
        "semester": 3,
        "ECTS": 6,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Δημήτρης Αχλιόπτας",
        "Hours": 4,
        "Description": "Αξιώματα πιθανότητας. Δεσμευμένη πιθανότητα και στοχαστική  ανεξαρτησία. Τυχαίες μεταβλητές, συναρτήσεις κατανομής και πυκνότητας πιθανότητας. Κατανομή συνάρτησης τυχαίας μεταβλητής. Ροπές και ειδικότερα μέση τιμή και τυπική απόκλιση. Βασικές διακριτές και συνεχείς κατανομές. Προσέγγιση του δειγματικού μέσου από τον θεωρητικό μέσο και της κατανομής αυτού από την κανονική κατανομή. Εκτίμηση παραμέτρων και έλεγχος στατιστικών υποθέσεων.",
        "id": 15100431
      },
    {
        "subjectName": "Σήματα και Συστήματα",
        "semester": 3,
        "ECTS": 6,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Γιάννης Παναγάκης",
        "Hours": 4,
        "Description": "Βασικές κατηγορίες σημάτων, φασματική αναπαράσταση περιοδικών και απεριοδικών σημάτων, βασικές κατηγορίες συστημάτων, συγκεραστική αναπαράσταση, καταστατικά μοντέλα, περιγραφή συστημάτων με διαφορικές εξισώσεις και εξισώσεις πεπερασμένων διαφορών, μετασχηματισμοί Fourier, Laplace και Z, διαγράμματα Bode, ευστάθεια, δειγματοληψία και κβάντιση.",
        "id": 15100126
      },
    {
        "subjectName": "Αλγόριθμοι και Πολυπλοκότητα",
        "semester": 4,
        "ECTS": 8,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Ζησιμόπουλος Βασίλειος/Εμίρης Ιωάννης",
        "Hours": 6,
        "Description": "Το μάθημα εισάγει τις έννοιες της σχεδίασης και ανάλυσης του αλγορίθμου και παρουσιάζει τα βασικά μαθηματικά εργαλεία που χρησιμοποιούνται για την αποτίμηση της απόδοσής του. Περιγράφει τις τεχνικές αναζήτησης σε σύνολα (union and find) και παρουσιάζει τις θεμελιώδεις τεχνικές διάσχισης σε γραφήματα, κατά πλάτος (BFS) και κατά βάθος (DFS). Εστιάζει στις τρεις βασικές μεθόδους σχεδίασης αλγορίθμων, “διαίρει και βασίλευε”, άπληστοι (greedy) αλγόριθμοι και δυναμικός προγραμματισμός. Αναλύει τα χαρακτηριστικά κάθε μεθόδου και αναδεικνύει τα πρακτικά προβλήματα που επιλύονται αποτελεσματικά από κάθε μέθοδο. Ορίζει τα προβλήματα απόφασης και τις κλάσεις P και NP. Περιγράφει την έννοια της αναγωγής και προσδιορίζει τα προβλήματα NP-complete και NP-hard.",
        "id": 15100090
      },
    {
        "subjectName": "Δίκτυα Επικοινωνιών I",
        "semester": 4,
        "ECTS": 6,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Σταυρακάκης Ιωάννης, Βάιος Νάσος",
        "Hours": 4,
        "Description": "Βασικές έννοιες και σχεδιαστικές αρχές των δικτύων επικοινωνιών. Δομή του Διαδικτύου, ιστορία του Διαδικτύου. Επίπεδο εφαρμογής (HTTP, FTP, e-mail, DNS, P2P, δίκτυα διανομής περιεχομένου). Λειτουργίες του επιπέδου μεταφοράς (TCP, UDP, αξιόπιστη μεταφορά δεδομένων στο TCP, έλεγχος ροής, έλεγχος συμφόρησης). Επίπεδο δικτύου (δρομολογητές, διευθυνσιοδότηση, το πρωτόκολλο IP, πρωτόκολλα δρομολόγησης). Γενικευμένη προώθηση και SDN. Διαχείριση δικτύου και SNMP. Επίπεδο ζεύξης (τεχνικές ανίχνευσης λαθών, πρωτόκολλα πολλαπλής πρόσβασης, τοπικά δίκτυα (Ethernet, VLANs), εικονικές ζεύξεις (MPLS)).",
        "id": 15100405
      },
    {
        "subjectName": "Εργαστήριο Δικτύων Επικοινωνιών Ι",
        "semester": 4,
        "ECTS": 2,
        "Type": "Αυτοτελές Προαιρετικό Εργαστήριο",
        "Kateythinsi": "-",
        "Professor": "Βάιος Νάσος",
        "Hours": 2,
        "Description": "Το μάθημα καλύπτει ένα μεγάλο μέρος των θεμάτων που αφορούν την στοίβα πρωτοκόλλων TCP/IP του Διαδικτύου όπως:Κατασκευή καλωδίων Ethernet – Οργάνωση, παραμετροποίηση και έλεγχος συνδεσιμότητας ενός τοπικού δικτύου υπολογιστών – Χρήση του εργαλείου Wireshark για την καταγραφή της κίνησης δεδομένων (φίλτρα παρακολούθησης κι εμφάνισης) – Απομακρυσμένη πρόσβαση σε Η/Υ (Remote Desktop, Telnet) – ARP πρωτόκολλο – ΙΡ, MAC διευθύνσεις – Χρήση εντολών ping, netstat – Στατική δρομολόγηση – Λειτουργία Η/Υ ως δρομολογητής – Παραμετροποίηση Cisco δρομολογητών – Εφαρμογή πινάκων δρομολόγησης – Λειτουργία πρωτοκόλλων δρομολόγησης RIP, OSPF – Λειτουργία TCP, UDP – Λειτουργία πρωτοκόλλων DHCP, ΝΑΤ.",
        "id": 15100484
      },
      {
        "subjectName": "Συστήματα Επικοινωνιών",
        "semester": 4,
        "ECTS": 7,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Γεώργιος Αλεξανδρόπουλος",
        "Hours": 5,
        "Description": "Εισαγωγή στα Τηλεπικοινωνιακά Συστήματα, Ανασκόπηση Θεωρίας Σημάτων, Τυχαίες Διαδικασίες και Θόρυβος, Αναλογικές Επικοινωνίες (Διαμόρφωση Πλάτους και Φάσης), Μετατροπή Αναλογικού Σήματος σε Ψηφιακό και από Ψηφιακό σε Αναλογικό, Ψηφιακή Εκπομπή και Λήψη, Εργαστήριο Προσομοίωσης Επικοινωνιακών Συστημάτων σε MATLAB.",
        "id": 15100472
      },
    {
      "subjectName": "Σχεδίαση και Χρήση Βάσεων Δεδομένων",
        "semester": 4,
        "ECTS": 7,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Δημήτριος Γουνόπουλος, Γιάννης Ιωαννίδης, Μαρία Ρούσσου",
        "Hours": 5,
        "Description": "Το μάθημα Σχεδίαση και Χρήση Βάσεων Δεδομένων είναι το πρώτο από τα δύο βασικά μαθήματα Βάσεων Δεδομένων στο Πρόγραμμα Προπτυχιακών Σπουδών και καλύπτει θέματα των επάνω στρωμάτων ενός συστήματος βάσεων δεδομένων, δηλ., του λογικού και του σημασιολογικού επιπέδου, και της εξωτερικής διάδρασης. (Το δεύτερο είναι το μάθημα Υλοποίηση Συστημάτων Βάσεων Δεδομένων, στο 5ο εξάμηνο, το οποίο καλύπτει θέματα που αφορούν στα χαμηλότερα στρώματα, δηλ., το φυσικό επίπεδο, με ευρετήρια, κτλ.).Συγκεκριμένα, το μάθημα καλύπτει τα εξής: μοντέλο Οντοτήτων-Συσχετίσεων (Ο/Σ), σχεδιασμός σχημάτων βάσεων με το μοντέλο Ο/Σ, σχεσιακό μοντέλο δεδομένων, μετάφραση από το Ο/Σ στο σχεσιακό, μελέτη σχεσιακών σχημάτων με επίκεντρο τις συναρτησιακές εξαρτήσεις, κανονικές μορφές σχεσιακών σχημάτων, η γλώσσα SQL, η γλώσσα QBE, φόρμες επικοινωνίας, κατάλογοι συστήματος, όψεις, περιορισμοί, ανάπτυξη εφαρμογών με ενσωματωμένη SQL, ανάπτυξη εφαρμογών πάνω από πρότυπες διεπαφές επικοινωνίας με βάσεις (python, και ίσως PHP, JDBC), βάσεις και διαδίκτυο. Εκτός από την κάλυψη της ύλης, το μάθημα περιλαμβάνει εργασία με 3 υποχρεωτικές ασκήσεις και ένα τελικό διαγώνισμα, το σύνολο των οποίων θα αποφασίσουν τον τελικό βαθμό.",
        "id": 15100471
      },
      {
        "subjectName": "Αριθμητική Ανάλυση",
        "semester": 5,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CS",
        "Professor": "Φίλιππος Τζαφέρης",
        "Hours": 5,
        "Description": "Στοιχεία θεωρίας σφαλμάτων. Αριθμητική λύση μη γραμμικών εξισώσεων (μέθοδος του σταθερού σημείου, Newton-Raphson). Αριθμητικές μέθοδοι επίλυσης γραμμικών συστημάτων (άμεσοι και επαναληπτικές). Αριθμητικές μέθοδοι υπολογισμού ιδιοτιμών-ιδιοδιανυσμάτων. Παρεμβολή. Μέθοδος ελαχίστων τετραγώνων. Αριθμητική παραγώγιση. Αριθμητική ολοκλήρωση. Εισαγωγή στην αριθμητική επίλυση συνήθων διαφορικών εξισώσεων.",
        "id": 15100402
      },
      {
        "subjectName": "Αρχές Γλωσσών Προγραμματισμού",
        "semester": 5,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Ροντογιάννης Παναγιώτης",
        "Hours": 4,
        "Description": "Το μάθημα καλύπτει βασικά και προχωρημένα θέματα των Αρχών Γλωσσών Προγραμματισμού που αποτελούν απαραίτητο υπόβαθρο σε διάφορους κλάδους της Πληροφορικής. Ιστορία των γλωσσών προγραμματισμού. Συντακτικό και σημασιολογία. Τύποι δεδομένων, εμβέλεια, διαδικασίες, μέθοδοι περάσματος παραμέτρων, υλοποίηση διαδικασιών. Βασικές κατηγορίες γλωσσών προγραμματισμού: διαδικαστικές, αντικειμενοστραφείς, λογικές, συναρτησιακές, παράλληλες. Θεωρητικά θέματα γλωσσών προγραμματισμού. Τεχνικές μετασχηματισμού και βελτιστοποίησης προγραμμάτων. Απόδειξη ορθότητας προγραμμάτων με τη χρήση της λογικής (λογική Floyd-Hoare). Λάμδα-λογισμός χωρίς τύπους: μετατροπές, κανονικές μορφές, θεώρημα Church-Rosser, εκφραστική ισχύς, εφαρμογές στις γλώσσες προγραμματισμού. Λάμδα-λογισμός με τύπους. Θεωρία τύπων και συστήματα εξαγωγής τύπων.",
        "id": 15100409
      },
    {
        "subjectName": "Αρχιτεκτονική Υπολογιστών ΙΙ",
        "semester": 5,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CΕT",
        "Professor": "Γκιζόπουλος Δημήτρης, Ξεργιάς Σπυρίδων",
        "Hours": 5,
        "Description": "Γενικές αρχές διοχέτευσης, υλοποίηση διοχέτευσης στον επεξεργαστή MIPS, σχεδίαση διαδρομής δεδομένων με διοχέτευση, σχεδίαση μονάδας ελέγχου διοχέτευσης, κίνδυνοι δεδομένων, προώθηση, καθυστερήσεις, κίνδυνοι ελέγχου/διακλάδωσης, στατική πρόβλεψη διακλάδωσης, μείωση καθυστέρησης διακλαδώσεων, δυναμική πρόβλεψη διακλάδωσης, καθυστερημένη διακλάδωση, εξαιρέσεις και χειρισμός εξαιρέσεων στην διοχέτευση, βασικές έννοιες προηγμένης διοχέτευσης, παραλληλία επιπέδου εντολής, στατική και δυναμική πολλαπλή εκκίνηση, η έννοια της εικασίας, αξιοποίηση της ιεραρχίας της μνήμης, τα βασικά των κρυφών μνημών, μέτρηση και βελτίωση της απόδοσης της κρυφής μνήμης, εικονική μνήμη, ένα κοινό πλαίσιο για ιεραρχίες μνήμης, αποθήκευση στο δίσκο και φερεγγυότητα, δίαυλοι και άλλες συνδέσεις μεταξύ επεξεργαστών, μνήμης και συσκευών εισόδου/εξόδου, διασύνδεση συσκευών εισόδου/εξόδου με τον επεξεργαστή, τη μνήμη και το λειτουργικό σύστημα, σχεδίαση συστήματος εισόδου/εξόδου.",
        "id": 15100098
      },
      {
        "subjectName": "Γραφικά Ι",
        "semester": 5,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Θεοχάρης Θεοχάρης",
        "Hours": 4,
        "Description": "Εισαγωγή: ιστορία, τεχνολογία, εφαρμογές Γραφικών. Μαθηματικές καμπύλες και πεπερασμένες διαφορές, αλγόριθμοι σχεδίασης ευθυγράμμων τμημάτων, γενικών πολυγώνων, τργώνων. Αντιταύτιση (antialiasing) με προ- και μετα-φιλτράρισμα. Συσχετισμένοι (affine) μετασχηματισμοί, μετασχηματισμοί δύο και τριών διαστάσεων, ομογενείς συντεταγμένες, σύνθεση μετασχηματισμών. Παραδείγματα μετασχηματισμών. Μετασχηματισμός παρατήρησης (viewing transformation). Γράφοι σκηνής (scene graphs). Αλγόριθμοι αποκοπής ευθυγράμμων τμημάτων και πολυγώνων σε δύο και τρεις διαστάσεις. Προβολές. Περικοπή πίσω όψεων. Αλγόριθμος απόκρυψης z-buffer. Βασικές αρχές και αλγόριθμοι φωτισμού. Μοντέλα παράστασης χρωμάτων. Εργαστήρια προγραμματισμού OpenGL. Επιλογές από τα παρακάτω θέματα: παραμετρικές καμπύλες και επιφάνειες, αρχές παράστασης υφής (texture mapping), αρχές συνθετικής κίνησης (animation).",
        "id": 15100163
      },
      {
        "subjectName": "Δίκτυα Επικοινωνιών II",
        "semester": 5,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CET",
        "Professor": "Θεοχάρης Θεοχάρης",
        "Hours": 5,
        "Description": "Το μάθημα στοχεύει στη κάλυψη, σε προπτυχιακό επίπεδο, των εξής θεματικών ενοτήτων:Καθυστέρηση Αναμονής σε Δίκτυα Μεταγωγής Πακέτων.Ασύρματα/Κινητά Δίκτυα (ασύρματα τοπικά δίκτυα, υποστήριξη κινητικότητας στο Διαδίκτυο, κινητά δίκτυα νέας γενιάς).Δικτύωση και Εφαρμογές Πολυμέσων.Ασφάλεια Δικτύων.",
        "id": 15100439
      },
      {
          "subjectName": "Εργαστήριο Δικτύων Επικοινωνιών Ι",
          "semester": 5,
          "ECTS": 2,
          "Type": "Αυτοτελές Προαιρετικό Εργαστήριο",
          "Kateythinsi": "-",
          "Professor": "Βάιος Νάσος",
          "Hours": 2,
          "Description": "Το μάθημα καλύπτει ένα μεγάλο μέρος των θεμάτων που αφορούν την στοίβα πρωτοκόλλων TCP/IP του Διαδικτύου όπως:Κατασκευή καλωδίων Ethernet – Οργάνωση, παραμετροποίηση και έλεγχος συνδεσιμότητας ενός τοπικού δικτύου υπολογιστών – Χρήση του εργαλείου Wireshark για την καταγραφή της κίνησης δεδομένων (φίλτρα παρακολούθησης κι εμφάνισης) – Απομακρυσμένη πρόσβαση σε Η/Υ (Remote Desktop, Telnet) – ARP πρωτόκολλο – ΙΡ, MAC διευθύνσεις – Χρήση εντολών ping, netstat – Στατική δρομολόγηση – Λειτουργία Η/Υ ως δρομολογητής – Παραμετροποίηση Cisco δρομολογητών – Εφαρμογή πινάκων δρομολόγησης – Λειτουργία πρωτοκόλλων δρομολόγησης RIP, OSPF – Λειτουργία TCP, UDP – Λειτουργία πρωτοκόλλων DHCP, ΝΑΤ.",
          "id": 15100484
        },
    {
        "subjectName": "Κύματα, Κυματοδηγοί, Κεραίες",
        "semester": 5,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Τσίπουρας Αριστείδης",
        "Hours": 4,
        "Description": "Στοιχεία διανυσματικής ανάλυσης.Εξισώσεις Maxwell σε διαφορική και ολοκληρωτική μορφή.Εξίσωση κύματος.Διάνυσμα Poynting και ισχύς κυμάτων.Μιγαδική αναπαράσταση πεδίων. Αρμονικά πεδία. Επίπεδα κύματα.Πόλωση κυμάτων.Ανάκλαση και Διάθλαση επίπεδων κυμάτων.Βασικές παράμετροι κεραιών.Ακτινοβολία στοιχειώδους διπόλου.Γραμμικές κεραίες.Χαρακτηριστικοί τύποι κεραιών.Ανάλυση και Σύνθεση στοιχειοκεραιών.",
        "id": 15100129
      },
    {
        "subjectName": "Λειτουργικά Συστήματα",
        "semester": 5,
        "ECTS": 8,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "-",
        "Professor": "Στάθης Χατζηευθυμιάδης/Αλέξης Δελής",
        "Hours": 5,
        "Description": "Ο σκοπός αυτού του μαθήματος είναι να εξετάσει τις βασικές ιδέες και αρχές των μοντέρνων Λειτουργικών Συστημάτων (ΛΣ): υπηρεσίες, προγράμματα και κλήσεις συστήματος, δομές πυρήνα, βασικές μέθοδοι εισόδου-εξόδου σε υπολογιστικά συστήματα, διαχωρισμός υπολογιστικών εργασιών πυρήνα και χώρο-χρήστη, οργάνωση διεργασιών στην μνήμη, χάρτες μνήμης, κοινά προσπελάσιμα τμήματα μνήμης, συγχρονισμός μεταξύ διεργασιών, τεχνικές διαχείρισης μνήμης, βασικές πολιτικές για κατανομή πόρων, συστήματα αρχείων, είσοδος και έξοδος, αδιέξοδα, υπολογιστικά νήματα και βασικές αρχές ασφάλειας Λειτουργικών Συστημάτων. Τα διάφορα κομμάτια των ΛΣ θα συζητηθούν σε σχέση με τη λειτουργία, τη δομή και την υλοποίησή τους. Η φύση του μαθήματος απαιτεί αυτενέργεια, συνεχή προσωπική προσπάθεια και εργασία κατανεμημένη στη διάρκεια όλου του εξαμήνου.",
        "id": 15100408
      },
    {
        "subjectName": "Παράλληλα Συστήματα",
        "semester": 5,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Βασίλειος Καρακώστας",
        "Hours": 4,
        "Description": "Το μάθημα καλύπτει την αρχιτεκτονική παράλληλων συστημάτων καθώς επίσης και τον προγραμματισμό τους, μέσω της σχεδίασης, της ανάπτυξης και της αξιολόγησης παράλληλων εφαρμογών. Εισαγωγή στην παράλληλη υπολογιστική (ανάγκη και προκλήσεις). Παράλληλο υλικό (συστήματα SIMD, MIMD, GPUs, δίκτυα διασύνδεσης, συνοχή και συνέπεια κρυφής μνήμης, συστήματα κοινόχρηστης και κατανεμημένης μνήμης). Παράλληλο λογισμικό (διεργασίες, πολυεργασίες, νήματα, συγχρονισμός και επικοινωνία σε κοινό χώρο διευθύνσεων και μέσω ανταλλαγής μηνυμάτων). Μέτρα επιτάχυνσης, επίδοσης, κλιμάκωσης. Ανάπτυξη παράλληλων προγραμμάτων (μεθοδολογία σχεδιασμού και αξιολόγησης παράλληλων εφαρμογών.) Παραλληλία  δεδομένων (data parallelism) και εργασιών (task parallelism). Προγραμματισμός συστημάτων κοινόχρηστης μνήμης με Pthreads και OpenMP, προγραμματισμός συστημάτων κατανεμημένης μνήμης με MPI, προγραμματισμός για κάρτες γραφικών (CUDA),  και υβριδικός συνδυασμός τους.",
        "id": 15100415
      },
    {
        "subjectName": "Σχεδίαση Ψηφιακών Συστημάτων - VHDL",
        "semester": 5,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Νεκτάριος Κρανίτης",
        "Hours": 4,
        "Description": "Επανάληψη σε θέματα αρχών και πρακτικών ακολουθιακής λογικής.Ανάλυση χρονισμού ψηφιακών συστημάτων, μετασταθερότητα και συγχρονιστές.Αριθμητικά συστήματα σταθερής και κινητής υποδιαστολής.Αύξηση επιδόσεων ψηφιακού συστήματος με χωρικό και χρονικό παραλληλισμό.Γλώσσα περιγραφής υλικού VHDL για προσομοίωση και σύνθεση.Περιγραφή ψηφιακών δομικών στοιχείων σε VHDL.Αρχιτεκτονική επεξεργαστών ARM (εντολές, συμβολική γλώσσα, προγραμματισμός, γλώσσα μηχανής).Λεπτομερείς σχεδίαση επεξεργαστή αρχιτεκτονικής ARM και για τις τρεις βασικές μικροαρχιτεκτονικές του (ενός κύκλου, πολλών κύκλων και διοχέτευσης).Ανάλυση επιδόσεων και κόστος για τις τρεις βασικές μικροαρχιτεκτονικές.Χρήση αναπτυξιακής κάρτας Zedboard και επαλήθευση της ορθής σχεδίασης στο επίπεδο του FPGA.",
        "id": 15100433
      },
    {
        "subjectName": "Τεχνητή Νοημοσύνη I",
        "semester": 5,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Μανόλης Κουμπαράκης",
        "Hours": 4,
        "Description": "Εισαγωγή στην Τεχνητή Νοημοσύνη. Ευφυείς πράκτορες.Λύση προβλημάτων με πράκτορες αναζήτησης (search agents). Στρατηγικές αναζήτησης: breadth-first search, uniform-cost search, depth-first search, depth-limited search, iterative deepening depth-first search, bi-directional search. Ευρετικές στρατηγικές αναζήτησης: greedy best-first search, A*-search. Αλγόριθμοι τοπικής αναζήτησης (local search). Προβλήματα ικανοποίησης περιορισμών (constraint satisfaction problems), λύση προβλημάτων ικανοποίησης περιορισμών με διάφορες παραλλαγές του backtracking search. Πράκτορες για αναπαράσταση γνώσης και λογισμό. Προτασιακή λογική και λογική πρώτης τάξης. Χρήση της προτασιακής και της λογικής πρώτης τάξης για αναπαράσταση γνώσης. Βάσεις γνώσεων και οντολογίες, παραδείγματα από διάφορες εφαρμογές.Συλλογιστική. Μodus ponens, unification, forward and backward chaining, resolution. Εισαγωγή στο λογικό προγραμματισμό και τη γλώσσα Prolog.",
        "id": 15100065
      },
    {
        "subjectName": "Τηλεπικοινωνιακά Δίκτυα",
        "semester": 5,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Βαρουτάς Δημήτρης, Κατσιάνης Δημήτρης",
        "Hours": 4,
        "Description": "Το μάθημα καλύπτει γενικότερα θέματα σχεδιασμού και υλοποίησης Τηλεπικοινωνιακών Δικτύων καθώς και τρέχοντα θέματα ρύθμισης διοίκησης και οικονομικής των τηλεπικοινωνιακών υποδομών.Παρουσιάζονται αναλυτικότερα: H δομή των Δημόσιων Τηλεπικοινωνιακών Δικτύων, οι αρχές πολυπλεξίας, τα βασικά Συστήματα μετάδοσης και η Σύγχρονη Ψηφιακή Ιεραρχία (SDH). Παρουσιάζονται επίσης οι αρχές, οι βασικές διατάξεις και οι σπουδαιότερες τεχνικές και συστήματα μεταγωγής με έμφαση στην Ψηφιακή Μεταγωγή. Επίσης θίγονται θέματα που αφορούν στον Έλεγχο Συστημάτων Μεταγωγής και τη Σηματοδοσία, τα Ευφυή τηλεπικοινωνιακά Δίκτυα (IN) και στις υπηρεσίες τους.Επιπλέον παρουσιάζονται η εξέλιξη και οι τεχνολογίες των σύγχρονων δικτύων πρόσβασης: από το δίκτυο ISDN (υπηρεσίες, βασικά χαρακτηριστικά, αρχιτεκτονική, σηματοδοσία) μέχρι τη μεταγωγή Πακέτου σε Δημόσια Τηλεπικοινωνιακά Δίκτυα (ΑΤΜ, MPLS).Παρουσιάζονται αναλυτικά οι προκλήσεις που θέτει η μετάβαση σε τεχνολογίες Ethernet και τηλεφωνίας ΙΡ.Θίγονται αναλυτικά θέματα δικτύων Πρόσβασης Νέας Γενιάς (NGA) με ιδιαίτερη έμφαση στα δίκτυα βασισμένα στις τεχνολογίες xDSL και η μετάβαση προς τα δίκτυα οπτικών ινών μέχρι το σπίτι (FTTH).Τα ανωτέρω συνδέονται με θέματα σχετικά με την απελευθέρωση της Τηλεπικοινωνιακής Αγοράς, τις Τηλεπικοινωνιακές Πολιτικές και τη Ρύθμιση καθώς και με βασικές έννοιες Διοίκησης και Οικονομικής τηλεπικοινωνιακών δικτύων και υποδομών.Στο εργαστηριακό σκέλος λειτουργεί εργαστήριο προσομοίωσης Τηλεπικοινωνιακών δικτύων με χρήση προσομοιωτή δικτύων OMNET++ και υποδείγματα στον GNS3.",
        "id": 15100213
      },
    {
        "subjectName": "Υλοποίηση Συστημάτων Βάσεων Δεδομένων",
        "semester": 5,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CS",
        "Professor": "Γιάννης Ιωαννίδης",
        "Hours": 4,
        "Description": "Εισαγωγή στα Συστήματα Βάσεων Δεδομένων, διαφορές από Συστήματα Διαχείρισης Αρχείων, φυσικά χαρακτηριστικά εξωτερικών μονάδων αποθήκευσης (δίσκων), οργάνωση δεδομένων σε δίσκους, η έννοια του αρχείου, διαχείριση ενδιάμεσης μνήμης, πρωτεύουσες (primary) οργανώσεις αρχείων, δευτερεύουσες (secondary) οργανώσεις αρχείων, στατικές και δυναμικές δομές δεδομένων, ISAM, Β+ δένδρα, στατικός και δυναμικός κατακερματισμός (hashing), ταξινόμηση αρχείων που βρίσκονται σε δίσκους, σχεσιακή άλγεβρα, επεξεργασία τελεστών σχεσιακής άλγεβρας και αντίστοιχοι αλγόριθμοι, κόστος ανάλογα με τα διαθέσιμα ευρετήρια, βελτιστοποίηση επερωτήσεων σχεσιακής άλγεβρας, η έννοια της δοσοληψίας, έλεγχος συνδρομικότητας (ταυτόχρονης προσπέλασης), ανάκαμψη από βλάβες.",
        "id": 15100406
      },
    {
        "subjectName": "Ψηφιακή Επεξεργασία Σήματος",
        "semester": 5,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CET",
        "Professor": "Γεώργιος Αλεξανδρόπουλος",
        "Hours": 5,
        "Description": "Σήματα διακριτού χρόνου, γραμμικά χρονικά αμετάβλητα συστήματα, συνέλιξη. μετασχηματισμός Ζ, ιδιότητες, συνάρτηση μεταφοράς, ΦΕΦΕ (ΒΙΒΟ) ευστάθεια. Μετασχηματισμός Fourier διακριτών σημάτων. Θεώρημα δειγματοληψίας,  κριτήριο Nyquist. Διακριτός μετασχηματισμός Fourier (DFT), ιδιότητες, κυκλική συνέλιξη, ταχύς μετασχηματισμός Fourier (FFT). Σχήματα υλοποίησης συνάρτησης μεταφοράς: άμεσο, σειριακό και παράλληλα σχήματα υλοποίησης. Σχεδιασμός FIR φίλτρων, γραμμική φάση, ακολουθίες παραθύρωσης. Σχεδιασμός IIR φίλτρων, μετασχηματισμός αμετάβλητης κρουστικής απόκρισης, διγραμμικός μετασχηματισμός,  φίλτρα Butterworth. Αναλογικοί / Ψηφιακοί και Ψηφιακοί /  Αναλογικοί μετατροπείς.",
        "id": 15100412
      },
    {
        "subjectName": "Αλγόριθμοι-Θεμελιώσεις Μηχανικής Μάθησης",
        "semester": 6,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Δημήτρης Αχλιόπτας",
        "Hours": 4,
        "Description": "-",
        "id": 15100811
      },
    {
        "subjectName": "Αναγνώριση Προτύπων–Μηχανική Μάθηση",
        "semester": 6,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS/CET",
        "Professor": "Γιάννης Παναγάκης",
        "Hours": 4,
        "Description": "-",
        "id": 15100206
      },
    {
        "subjectName": "Ανάλυση/Σχεδίαση Συστημάτων Λογισμικού",
        "semester": 6,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Διογένης Αλεξανδράκης",
        "Hours": 4,
        "Description": "Η ύλη του μαθήματος έχει δομηθεί ως ακολούθως: Παραδοσιακές και Σύγχρονες τεχνικές και μεθοδολογίες για ανάπτυξη συστημάτων. Aνάλυση προβλήματος. Tεχνικές για συλλογή απαιτήσεων. Σύνταξη Προδιαγραφών Απαιτήσεων σύμφωνα με το πρότυπο ΙΕΕΕ. Αντικειμενοστρεφής Ανάλυση και Σχεδιασμός: Αρχές της Unified Modeling Language (UML) και διαγράμματα για μοντελοποίηση δεδομένων, ανάλυση, σχεδιασμό και υλοποίηση συστημάτων (use case diagrams, class diagrams, state diagrams, activity diagrams, collaboration diagrams, sequence diagrams, deployment diagrams, διαγράμματα πακέτων). Aνάλυση και Σχεδιασμός συστημάτων προσανατολισμένα στις διαδικασίες (Function - Oriented Analysis): Διαγράμματα Ροής Δεδομένων, Προδιαγραφές Διαδικασιών (Δομημένα αγγλικά, Πίνακες και δέντρα αποφάσεων, Λεξικό Δεδομένων). Σύντομη αναφορά στην Ανάλυση δεδομένων και το Μοντέλο οντοτήτων συσχετίσεων. Αναφορά σε Έλεγχο Απαιτήσεων. Αρχιτεκτονικές Λογισμικού, Αρχές σχεδιασμού συστημάτων, σύζευξη και συνοχή των modules, δομημένο διάγραμμα, αρχές για σχεδιασμό δεδομένων και διεπαφής χρήστη. Τεχνικές μετάβασης από την Ανάλυση Απαιτήσεων στον Σχεδιασμό. Δημιουργία Δομημένου Διαγράμματος. Δημιουργία Ψευδοκώδικα. Αναφορά σε μεθοδολογίες Ανάλυσης και Σχεδιασμού Συστημάτων Λογισμικού. Εργαλεία Computer Aided Software Engineering (CASE tools).",
        "id": 15100138
      },
    {
        "subjectName": "Ασύρματα Δίκτυα Αισθητήρων",
        "semester": 6,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Στάθης Χατζηευθυμιάδης",
        "Hours": 4,
        "Description": "-",
        "id": 15100456
      },
    {
        "subjectName": "Διαχείριση Δικτύων",
        "semester": 6,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CET",
        "Professor": "Αλωνιστιώτη Αθανασία",
        "Hours": 4,
        "Description": "Το μάθημα καλύπτει αφ’ ενός τα βασικά μοντέλα διαχείρισης σταθερών και ασύρματων/κινητών επικοινωνιών και αφ’ ετέρου τους βασικούς μηχανισμούς για τον σχεδιασμό, την ανάπτυξη και την αξιολόγηση Συστημάτων Διαχείρισης Δικτύων. Επίσης καλύπτει την Εισαγωγή στη διαχείριση δικτύων υπολογιστών, διαχείριση με βάση το μοντέλο FCAPS, οργάνωση συστήματος διαχείρισης και πλατφόρμες διαχείρισης. Αναλύει τη Δομή της πληροφορίας διαχείρισης, κατηγορίες υπό διαχείριση αντικειμένων και πρωτόκολλα διαχείρισης. Καλύπτει τις Υπηρεσίες διαχείρισης και το πρωτόκολλο SNMP. Λειτουργικές περιοχές και λειτουργίες διαχείρισης δικτύων. Μεθοδολογία σχεδιασμού συστήματος διαχείρισης δικτύου. Νέες τεχνολογίες διαχείρισης δικτύων, έννοιες της αυτο-διαχείρισης, της γνωσιακής διαχείρισης δικτύου και της διαχείρισης ετερογενών συστημάτων επικοινωνιών. Θέματα διαχείρισης κινητών και ασύρματων δικτύων και μελλοντικού Διαδικτύου. Ζητήματα διαχείρισης της ασφάλειας δικτύων.",
        "id": 15100423
      },
    {
        "subjectName": "Ειδικά Θέματα Επικοινωνιών και Επεξεργασίας Σήματος – Πολυμέσα και Ασύρματη Δικτύωση",
        "semester": 6,
        "ECTS": 4,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Νίκος Πασσάς - Παντελής Μπαλαούρας",
        "Hours": 3,
        "Description": "Το μάθημα είναι εργαστηριακό και αποτελεί ουσιαστικά το εργαστήριο του μαθήματος Δίκτυα Επικοινωνιών ΙΙ του 5ου εξαμήνου. Θα αποτελείται από ασκήσεις τις οποίες οι φοιτητές θα καλούνται να υλοποιήσουν, παραδίδοντας την αντίστοιχη αναφορά. Οι διαλέξεις θα περιλαμβάνουν την περιγραφή και ανάλυση των απαιτήσεων κάθε άσκησης, καθώς και απαντήσεις σε απορίες που θα προκύπτουν στην πορεία. Στόχος μας δεν είναι η μονόδρομη μεταφορά θεωρητικής γνώσης, αλλά η διάδραση με τους φοιτητές και η απόκτηση πρακτικών δεξιοτήτων στα προς μελέτη θέματα. Αν και τυπικά το μάθημα Πολυμέσα και Ασύρματη Δικτύωση δεν έχει προαπαιτούμενα, στην ουσία η επιτυχής παρακολούθηση του μαθήματος Δίκτυα Επικοινωνιών ΙΙ θεωρείται εξαιρετικά χρήσιμη για τους φοιτητές που θα παρακολουθήσουν και αυτό το μάθημα.",
        "id": 15100812
      },
    {
        "subjectName": "Επεξεργασία Στοχαστικών Σημάτων",
        "semester": 6,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Γεώργιος Αλεξανδρόπουλος",
        "Hours": 4,
        "Description": "Το μάθημα επικεντρώνεται στα στοχαστικά σήματα / τυχαίες διαδικασίες καλύπτοντας τα βασικά μαθηματικά εργαλεία του ποιοτικού και ποσοτικού χαρακτηρισμού τους καθώς και της επεξεργασίας τους. Στο πρώτο μέρος του μαθήματος περιλαμβάνεται επισκόπηση βασικών εννοιών της γραμμικής άλγεβρας (νόρμες, διανυσματικοί χώροι, ιδιοτιμές κι ιδιοδιανύσματα πινάκων), των πιθανοτήτων (ορισμοί κι ιδιότητες) και των τυχαίων μεταβλητών (στατιστικές συναρτήσεις και μετρικές, μετασχηματισμός τυχαίων μεταβλητών, πολλαπλές τυχαίες μεταβλητές, ανεξαρτησία, συσχέτιση, ορθογωνιότητα, αντιπροσωπευτικές κατανομές, εκτιμητές). Στο δεύτερο μέρος του μαθήματος μελετώνται οι τυχαίες διαδικασίες (φάσμα ισχύος, στασιμότητα, εργοδικότητα), η ανάλυσή τους στο πεδίο του χρόνου και της συχνότητας (περιοδιόγραμμα, φιλτράρισμα, ανάλυση σε πρωτεύουσες συνιστώσες, παραμετρικές μέθοδοι AR, MA, ARMA), τα φίλτρα Wiener, Kalman και το γραμμικά περιορισμένο φίλτρο ελάχιστης διασποράς καθώς κι εφαρμογές τους (επεξεργασία σε περιβάλλοντα θορύβου, γραμμική πρόβλεψη, αναγνώριση συστήματος, συστήματα πολλαπλών έξυπνων κεραιών) και βασικές μέθοδοι προσαρμοστικού φιλτραρίσματος (μέθοδος μέγιστης καθόδου, αλγόριθμοι LMS, NLMS, RLS). Η θεωρία κι οι ασκήσεις του μαθήματος περιέχουν παραδείγματα εφαρμογών των μεθόδων ανάλυσης κι επεξεργασίας στοχαστικών σημάτων σε συστήματα επικοινωνιών πέμπτης γενεάς (5G).",
        "id": 15100434
      },
    {
        "subjectName": "Επιστημονικοί Υπολογισμοί",
        "semester": 6,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Τζαφέρης Φίλιππος",
        "Hours": 4,
        "Description": "Ανάλυση Σφάλματος στους Αριθμητικούς Υπολογισμούς.Αριθμητική Επίλυση Γραμμικών Συστημάτων. Άμεσες (Απαλοιφή Gauss, Gauss-Jordan, LU) και επαναληπτικές μέθοδοι (SOR, SSOR, PSD, Ημι-Επαναληπτικές και Συζυγών Διευθύνσεων).Αριθμητικός Υπολογισμός Ιδιοτιμών και Ιδιοδιανυσμάτων (Jacobi, Givens, LR, QR, και Householder).Πρόβλημα Ελαχίστων Τετραγώνων.Αριθμητική Επίλυση Πολυωνυμικών Εξισώσεων (Bernoulli, Quotient-Difference, Muller, Steffensen, Graeffe’s και Bairstow) και Μη Γραμμικά Συστήματα (Newton και Newton-SOR).Εισαγωγή στην Αριθμητική Επίλυση Μερικών Διαφορικών Εξισώσεων.",
        "id": 15100092
      },
    {
        "subjectName": "Εργαστήριο Ηλεκτρονικής",
        "semester": 6,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Νικάς Θωμάς",
        "Hours": 4,
        "Description": "Το περιεχόμενο του Εργαστήριου Ηλεκτρονικής περιλαμβάνει τα εξής:(α) Μελέτη επαφής pn, προσομοίωση με spice, DC και AC ανάλυση, ορθή και ανάστροφη πόλωση, απλή ανόρθωση,(β) κυκλώματα διόδων, διπλή ανόρθωση με μεσαία λήψη, διπλή ανόρθωση με συνδεσμολογία γέφυρας, προσομοίωση με spice,(γ) δίοδος Zener, ορθή και ανάστροφη πόλωση διόδου Zener, χάραξη χαρακτηριστικής, κυκλώματα ψαλιδισμού, προσομοίωση με spice,(δ) σταθεροποίηση τάσης με δίοδο Zener, σχεδίαση τροφοδοτικού με δίοδο Zener, προσομοίωση με το spice,(ε) Πόλωση του τρανζίστορ, συνδεσμολογία κοινού εκπομπού, υπολογισμοί σημείου ηρεμίας, συνδεσμολογία ενισχυτή κοινού εκπομπού χαμηλών συχνοτήτων, μελέτη απολαβής και εσωτερικών αντιστάσεων, προσομοίωση με το spice(στ) ενισχυτής ακουστικών συχνοτήτων με MOSFET, προσομοίωση με το spice,(ζ) Απλός αναστροφέας με pMOS και nMOS τρανζίστορ, buffer, DC απόκριση, προσομοίωση με το spice.",
        "id": 15100455
      },
    {
        "subjectName": "Ηλεκτρονική",
        "semester": 6,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CET",
        "Professor": "Συβρίδης Δημήτριος",
        "Hours": 4,
        "Description": "Ενισχυτές, βασικά χαρακτηριστικά, επιδόσεις, μοντέλα κυκλωμάτων για ενισχυτές, απόκριση συχνότητας. Τελεστικοί ενισχυτές, αναστρέφουσα / μη αναστρέφουσα συνδεσμολογία, κυκλώματα διαφορικών ενισχυτών, ολοκληρωτών και διαφοριστών. Εισαγωγή στους ημιαγωγούς (ενδογενείς ημιαγωγοί, ημιαγωγοί τύπου-n και τύπου-p, η επαφή pn, πόλωση της επαφής pn, χαρακτηριστική τάσης ρεύματος της επαφής pn, η δίοδος pn). Εφαρμογές της διόδου (ανορθωτές - ημιανόρθωση - πλήρης ανόρθωση, φίλτρα διήθησης, περιοριστής, ψαλιδιστής, πολλαπλασιαστές τάσης). Δίοδοι ειδικού σκοπού (δίοδος Zener και εφαρμογές, δίοδος Varactor, οπτικές δίοδοι, άλλοι τύποι διόδων). Διπολικά τρανζίστορ επαφής (BJT) (η δομή του τρανζίστορ, η βασική λειτουργία του τρανζίστορ, οι χαρακτηριστικές και οι παράμετροι του τρανζίστορ, το τρανζίστορ σαν ενισχυτής, το τρανζίστορ σαν διακόπτης, λογικές πύλες). Κυκλώματα πόλωσης των τρανζίστορ. Διπολικοί ενισχυτές μικρού σήματος (η λειτουργία μικρού σήματος του ενισχυτή, ισοδύναμα κυκλώματα μικρού σήματος (AC) του τρανζίστορ, ενισχυτής κοινού εκπομπού, ενισχυτής κοινού συλλέκτη, ενισχυτής κοινής βάσης). Απόκριση κατά συχνότητα των ενισχυτών.",
        "id": 15100013
      },
    {
        "subjectName": "Θεωρία Πληροφορίας και Κωδίκων",
        "semester": 6,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CET",
        "Professor": "Δημήτρης Μαρούλης",
        "Hours": 4,
        "Description": "Μάθημα 1: C. E. Shannon: Η ζωή το έργο και η επίδραση του στις σύγχρονες επικοινωνίες.Μάθημα 2: Μέτρα πληροφορίας και βασικές ιδιότητες: εντροπία, αμοιβαία πληροφορία, απόσταση KL, κυρτότητα.Μάθημα 3: Τυπικότητα και ιδιότητα της ασυμπτωτικής ισοδιαμέρισης.Μάθημα 4: Στατικές (εργοδικές ) πηγές και ρυθμός εντροπίας.Μάθημα 5: Συμπίεση πηγής χωρίς απώλειες, κώδικες προθέματος, θεμελιώδη όρια συμπίεσης με βάση το ρυθμό εντροπίας, κώδικες Shannon, κώδικες Hufman.Μάθημα 6: Χωρητικότητα καναλιού παραδείγματα (δυαδικό συμμετρικό κανάλι, κανάλι διαγραφής) και ιδιότητες, διατύπωση και απόδειξη του θεωρήματος κωδικοποίησης καναλιού για διακριτά κανάλια χωρίς μνήμη, επιτευξιμότητα, από κοινού τυπικότητα.Μάθημα 7: ανισότητα Fano και αντίστροφο θεώρημα, χωρητικότητα ανάδρασης.Μάθημα 8: Πηγές και κανάλια συνεχούς χρόνου, διαφορική εντροπία, αμοιβαία πληροφορία και ιδιότητες, εντροπία κανονικού τυχαίου διανύσματος.Μάθημα 9: Το αθροιστικό Γκαουσιανό κανάλι, τυπικότητα, θεώρημα κωδικοποίησης , χωρητικότητα ΑWGN καναλιού, χωρητικότητα ζωνοπερατών καναλιών.Μάθημα 10: Παράλληλα Γκαουσιανά κανάλια, κανάλι με έγχρωμο θόρυβο, κατανομή ισχύος με σκοπό τη μεγιστοποίηση του ρυθμού μετάδοσης, μέθοδος γεμίσματος νερού.Μάθημα 11: κωδικοποίηση πηγής με κώδικες συρμού, αριθμητικοί κώδικες και κωδικοποίηση Lempel Ziv.Μάθημα 12: εισαγωγή στη θεωρία ρυθμού παραμόρφωσης κα συμπίεση με απώλειες.Μάθημα 13: Γραμμικοί κώδικες, περιγραφή και κωδικοποίηση, κώδικες Hamming.Μάθημα 14: Συγκεραστικοί κώδικες trellis αποκωδικοποίηση και αλγόριθμος Viterbi.Μάθημα 15: Κώδικες turbo, επαναληπτική αποκωδικοποίηση και αλγόριθμος BCJR.Μάθημα 16: Κώδικες LDPC γράφοι παραγόντων και Tanner αποκωδικοποίηση με τον αλγόριθμο μεταβίβασης μηνυμάτων.",
        "id": 15100432
      },
    {
        "subjectName": "Θεωρία Υπολογισμού",
        "semester": 6,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CS",
        "Professor": "Ροντογιάννης Παναγιώτης",
        "Hours": 4,
        "Description": "Το μάθημα καλύπτει βασικά και προχωρημένα θέματα της Θεωρίας Υπολογισμού που αποτελούν απαραίτητο υπόβαθρο σε διάφορους κλάδους της Θεωρητικής Πληροφορικής. Τυπικές γλώσσες. Ντετερμινιστικά και μη-ντετερμινιστικά πεπερασμένα αυτόματα. Κανονικές γλώσσες. Γλώσσες χωρίς συμφραζόμενα. Μη-ντετερμινιστικά αυτόματα στοίβας. Μηχανές Turing. Αναδρομικές γλώσσες. Αναδρομικά απαριθμήσιμες γλώσσες. Η Θέση των Church-Turing. Αποφασισιμότητα. Εισαγωγή στην υπολογιστική πολυπλοκότητα.",
        "id": 15100428
      },
    {
        "subjectName": "Λογικός Προγραμματισμός",
        "semester": 6,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Παναγιώτης Σταματόπουλος",
        "Hours": 4,
        "Description": "Γενικά περί διαδικαστικού και δηλωτικού προγραμματισμού. Ο λογικός προγραμματισμός σαν μία εκδοχή του δηλωτικού προγραμματισμού. Η γλώσσα προγραμματισμού Prolog. Σύνταξη προγραμμάτων. Λίστες. Τελεστές. Αριθμητική. Έλεγχος οπισθοδρόμησης. Άρνηση στην Prolog. Ενσωματωμένα κατηγορήματα. Χειρισμός δομών δεδομένων. Απλές εφαρμογές της Prolog σε προβλήματα αναζήτησης, συμβολική επεξεργασία, κατανόηση φυσικής γλώσσας και μεταπρογραμματισμό. Θεωρία λογικού προγραμματισμού. Ερμηνείες και μοντέλα. Μοντελοθεωρητική σημασιολογία. Σημασιολογία σταθερού σημείου. Ενοποίηση. SLD-επίλυση. Λειτουργική σημασιολογία. Λογικός προγραμματισμός με περιορισμούς. Τεχνικές υλοποίησης συστημάτων λογικού προγραμματισμού. Παράλληλος λογικός προγραμματισμός. Λογικός προγραμματισμός για αναπαράσταση γνώσης. Αναπαράσταση γνώσης - μεθοδολογίες και υλοποιήσεις τους με χρήση της Prolog. Συστήματα βασισμένα σε γνώση - η περίπτωση των εμπείρων συστημάτων. Συμπερασματικές βάσεις δεδομένων - η περίπτωση της Datalog. Λογικός προγραμματισμός και παγκόσμιος ιστός.",
        "id": 15100141
      },
    {
        "subjectName": "Μαθηματικά Πληροφορικής",
        "semester": 6,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CS",
        "Professor": "Κολλιόπουλος Σταύρος",
        "Hours": 5,
        "Description": "Το μάθημα καλύπτει βασικές και προχωρημένες τεχνικές των Διακριτών Μαθηματικών που είναι απαραίτητες στη μελέτη και την ανάλυση υπολογιστικών μοντέλων και συστημάτων. Μέθοδοι αποδείξεων με έμφαση στην επαγωγή και στις αποδείξεις ύπαρξης (αρχή του Περιστερεώνα, διαγωνοποίηση). Εφαρμογές των μεθόδων σε προβλήματα ακολουθιών και στη Θεωρία Αριθμών. Στοιχεία Θεωρίας Ramsey. Αριθμήσιμα και μη αριθμήσιμα σύνολα. Θεωρία γραφημάτων: δέντρα, συνεκτικότητα, επιπεδότητα, ταιριάσματα σε διμερή γραφήματα. Σχέσεις ισοδυναμίας και σχέσεις μερικής διάταξης. Θεωρήματα Sperner και Dilworth. Εργαλεία από τη Θεωρία Πιθανοτήτων.",
        "id": 15100464
      },
    {
        "subjectName": "Μεταγλωττιστές",
        "semester": 6,
        "ECTS": 6,
        "Type": "Κατ’ Επιλογή Υποχρεωτικό",
        "Kateythinsi": "CS",
        "Professor": "Αθανάσιος Ανδρούτσος",
        "Hours": 5,
        "Description": "Εξερεύνηση θεμελιωδών εννοιών και τεχνικών μεταγλώττισης. (1) Τυπικές γλώσσες: κανονικές γλώσσες, γλώσσες χωρίς συμφραζόμενα, κατηγορικές γραμματικές. (2) Λεκτική ανάλυση, χρήση μεταεργαλείων για τη δημιουργία λεκτικών αναλυτών. (3) Συντακτική ανάλυση: συντακτικοί αναλυτές από πάνω προς τα κάτω (top-down) και από κάτω προς τα πάνω (bottom-up), ανάνηψη από σφάλματα, χρήση μεταεργαλείων για τη δημιουργία συντακτικών αναλυτών. (4) Πίνακας συμβόλων. Σημασιολογική ανάλυση: είδη σημασιολογικών ελέγχων, συστήματα τύπων, δυναμικός έλεγχος τύπων. (5) Παραγωγή ενδιάμεσου κώδικα. (6) Βελτιστοποίηση κώδικα. (7) Παραγωγή τελικού κώδικα.",
        "id": 15100091
      },
    {
        "subjectName": "Προγραμματισμός Συστήματος",
        "semester": 6,
        "ECTS": 8,
        "Type": "Υποχρεωτικό",
        "Kateythinsi": "CS",
        "Professor": "Γιάννης Σμαραγδάκης",
        "Hours": 4,
        "Description": "Ο στόχος αυτού του μαθήματος είναι να εξετάσει σε βάθος το περιβάλλον Unix ως περιβάλλον ανάπτυξης. Θα εξετάσουμε την προγραμματιστική διεπαφή (API) του Linux για τις γλώσσες C/C++ καθώς επίσης και το κέλυφος (shell) του Linux. Θα καλύψουμε θέματα όπως: βοηθητικά προγράμματα του Unix, προγραμματισμός σε κέλυφος (shell programming), γλώσσες σεναρίων (script languages), προγραμματισμός λειτουργιών συστήματος σε C/C++ για χειρισμό λαθών, δημιουργία και τερματισμό διεργασιών, αποστολή/παραλαβή σημάτων, είσοδο/έξοδο χαμηλού επιπέδου, επικοινωνία μεταξύ τοπικών διεργασιών, δημιουργία, τερματισμό και συγχρονισμό νημάτων, διαχείριση συστήματος αρχείων, καθώς επίσης και μηχανισμοί απομακρυσμένης επικοινωνίας. Από τη φύση του, το μάθημα αυτό χρειάζεται αυτενέργεια και συνεχή προσωπική προσπάθεια.",
        "id": 15100204
      },
    {
        "subjectName": "Τεχνικές Εξόρυξης Δεδομένων",
        "semester": 6,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Γουνόπουλος Δημήτριος",
        "Hours": 4,
        "Description": "Το μάθημα καλύπτει θέματα τεχνικών εξόρυξης δεδομένων: Δεδομένα, προβλήματα, εφαρμογές. Γενικές τεχνικές ανάλυσης και επεξεργασίας δεδομένων. Αλγόριθμοι κατηγοριοποίησης δεδομένων (δένδρα αποφάσεων, στατιστικές τεχνικές). Αλγόριθμοι κατηγοριοποίησης δεδομένων για πολυδιάστατα δεδομένα και για χρονοσειρές. Τεχνικές για ομαδοποίηση δεδομένων. Τεχνικές για ανεύρεση συσχετισμών σε πολυδιάστατα δεδομένα και σε σχεσιακά δεδομένα. Εφαρμογές των τεχνικών εξόρυξης δεδομένων σε προβλήματα αναζήτησης στο διαδίκτυο και σε προβλήματα σε βιοϊατρική.",
        "id": 15100492
      },
    {
        "subjectName": "Τεχνολογίες Εφαρμογών Διαδικτύου",
        "semester": 6,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Χαμόδρακας Ιωάννης",
        "Hours": 4,
        "Description": "Το μάθημα εστιάζει στον σχεδιασμό και την ανάπτυξη σύγχρονων εφαρμογών διαδικτύου με έμφαση στις εφαρμογές παγκόσμιου ιστού. Παρουσιάζει την αρχιτεκτονική και την υποδομή του παγκόσμιου ιστού και την αρχιτεκτονική εφαρμογών πελάτη/εξυπηρετητή (client/server) με έμφαση στην αρχιτεκτονική των εφαρμογών παγκόσμιου ιστού πολλών στρωμάτων. Τα θέματα που καλύπτονται περιλαμβάνουν τις ακόλουθες γνωστικές περιοχές και τεχνολογίες: Λειτουργία εξυπηρετητών / περιηγητών ιστού (Web Server / Web Browser). Πρωτόκολλο HTTP. Γλώσσες HTML/CSS και Javascript/Typescript. Συστήματα διαχείρισης σχεσιακών βάσεων δεδομένων στο διαδίκτυο (MySQL). Συστήματα NoSQL βάσεων δεδομένων (MongoDB). Τεχνολογίες νωτιαίου άκρου (Backend): Servlets, Υπηρεσίες Ιστού RESTful, Αντικειμενοσχεσιακή απεικόνιση (Object-Relational Mapping), Δεξαμενές συνδέσεων (Connection pooling). Τεχνολογίες μετωπιαίου άκρου (Frontend): Javascript, Angular 5. Πρότυπα αρχιτεκτονικής εφαρμογών παγκόσμιου ιστού (Model 1, Model-View-Controller). Ασφάλεια στον παγκόσμιο ιστό (SSL/TLS και JSON Web Token). Εργασία σχεδιασμού και ανάπτυξης ολοκληρωμένης εφαρμογής παγκόσμιου ιστού και υποσυστήματος συστάσεων (recommender system).",
        "id": 15100420
      },
    {
        "subjectName": "Αλγοριθμική Επιχειρησιακή Έρευνα",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS/CET",
        "Professor": "Ζησιμόπουλος Βασίλειος",
        "Hours": 4,
        "Description": "Το μάθημα καλύπτει βασικά μαθηματικά μοντέλα λήψης αποφάσεων και παρουσιάζει αλγοριθμικές τεχνικές επίλυσής τους. Εστιάζει στο γραμμικό προγραμματισμό και στον αλγόριθμο simplex, στην δυϊκή θεωρία και στα προβλήματα μεταφοράς. Στον ακέραιο προγραμματισμό περιγράφει τις τεχνικές branch and bound για προβλήματα packing, covering και σακιδίου (knapsack problem) και του γενικευμένου γραμμικού προγραμματισμού για προβλήματα τεμαχισμού (cutting stock problems). Περιγράφει τεχνικές αποτίμησης της απόδοσης των αλγορίθμων (εμπειρική αποτίμηση, λόγος προσεγγισιμότητας). Αναπτύσσει αλγόριθμους τοπικής αναζήτησης και μελετά την δομή γειτονιάς και τις μεθόδους αναζήτησης στις γειτονιές για τα προβλήματα του πλανόδιου πωλητή (γειτονιές κ-OPT), της μέγιστης τομής (max cut) και της διαμέρισης γράφων (bipartitioning).",
        "id": 15100046
      },
    {
        "subjectName": "Ανάπτυξη Λογισμικού για Αλγοριθμικά Προβλήματα",
        "semester": 7,
        "ECTS": 8,
        "Type": "Project",
        "Kateythinsi": "CS",
        "Professor": "Γιάννης Εμίρης, Γιάννης Χαμόδρακας",
        "Hours": 4,
        "Description": "Το μάθημα συνίσταται στην ανάπτυξη λογισμικού για την επίλυση ενός σημαντικού προβλήματος της Πληροφορικής, τη χρήση του λογισμικού σε μια πρακτική εφαρμογή και την πειραματική αποτίμηση του λογισμικού που αναπτύχθηκε. Η προσέγγιση στοχεύει στην εξοικείωση με τον προγραμματισμό μεγάλης κλίμακας, συχνά με χρήση ανοικτών βιβλιοθηκών λογισμικού, μέσω συνεργασίας σε ομάδες, καθώς και στην ανάπτυξη δεξιοτήτων για την υλοποίηση και πρακτική χρήση γνωστών, αποδοτικών αλγορίθμων. Χρησιμοποιείται η γλώσσα C/C++ σε σύστημα Linux. Τα θέματα που καλύπτονται περιλαμβάνουν την υλοποίηση αποδοτικών αλγορίθμων, την πειραματική αξιολόγηση τους, τις αρχές οργάνωσης και σχεδίασης λογισμικού, τη χρήση ανοιχτών βιβλιοθηκών και εργαλειών λογισμικού, όπως τις βιβλιοθηκές Qt, Boost, Gnuplot, LAPACK, Eigen, πλατφόρμες Δοκιμών Μονάδων Λογισμικού (Unit testing), συστήματα ελέγχου εκδόσεων και συνεργατικής ανάπτυξης (git, SVN) καθώς και τη συνεργατική υλοποίηση μεγάλης κλίμακας.Δίδονται τρεις εργασίες σχεδίασης και ανάπτυξης λογισμικού για την επίλυση δύσκολων αλγοριθμικών προβλημάτων με έμφαση στις γνωστικές περιοχές της επιστήμης δεδομένων και της υπολογιστικής γεωμετρίας.",
        "id": 15104141
      },
    {
        "subjectName": "Ανάπτυξη Λογισμικού για Πληροφοριακά Συστήματα",
        "semester": 7,
        "ECTS": 8,
        "Type": "Project",
        "Kateythinsi": "CS",
        "Professor": "Γιάννης Ιωαννίδης",
        "Hours": 6,
        "Description": "Το μάθημα συνίσταται σε μια εκτεταμένη υλοποίηση υποσυστήματος βάσεως δεδομένων που εστιάζει σε βελτιστοποίηση συγκεκριμένων λειτουργιών. Η προσέγγιση στοχεύει στη σταδιακή εξοικείωση στον προγραμματισμό με προδιαγραφές ορθότητας, ασφάλειας, αποτελεσματικότητας και ταχύτητας και ως μέλη ομάδας. Συγκεκριμένα, περιλαμβάνει υλοποίηση κατάλληλων δομών δεδομένων που βελτιστοποιούν τη ζητούμενη λειτουργία, συντήρηση του κώδικα σε σύστημα κατανεμημένου ελέγχου (git), κάλυψη της λειτουργίας του κώδικα με ελέγχους μονάδας (unit testing). Το θέμα που συνήθως καλύπτεται προκύπτει από τον προγραμματιστικό διαγωνισμό SIGMOD της προηγούμενης χρονιάς.Μία ομάδα από επιλεγμένους, εθελοντές φοιτητές συμμετέχουν ως ομάδα του ΕΚΠΑ στον προγραμματιστικό διαγωνισμό SIGMOD της επόμενης χρονιάς, δεν παραδίδουν εργασία στο τυπικό μάθημα, και αξιολογείται η συμμετοχή και η αποτελεσματικότητα τους στη χρονική περίοδο του διαγωνισμού",
        "id": 15104142
      },
    {
        "subjectName": "Ανάπτυξη Λογισμικού για Συστήματα Δικτύων και Τηλεπικοινωνιών",
        "semester": 7,
        "ECTS": 8,
        "Type": "Project",
        "Kateythinsi": "CET",
        "Professor": "Νάνσυ Αλωνιστιώτη, Παντελής Μπαλαούρας",
        "Hours": 6,
        "Description": "Το μάθημα συνίσταται σε μια εκτεταμένη υλοποίηση δικτυακών λειτουργιών, πρωτοκόλλων και εφαρμογών. Η προσέγγιση στοχεύει στη σταδιακή εξοικείωση στον προγραμματισμό σε διαφορετικά δικτυακά επίπεδα. Πιο συγκεκριμένα, περιλαμβάνει προγραμματισμό για σταθερά και κινητά δίκτυα και εφαρμογές Μελλοντικού Διαδικτύου, κινητών και ασύρματων συστημάτων. Οι εφαρμογές και οι υλοποιήσεις αφορούν επίσης γνωσιακά και αναδιαμορφώσιμα περιβάλλοντα κινητών και ασύρματων επικοινωνιών (με χρήση π.χ. J2ME, Android). Ενδεικτικά θέματα που καλύπτονται είναι τα ακόλουθα.Η γλώσσα προγραμματισμού JAVA.Το λειτουργικό σύστημα για κινητές συσκευές Android και το περιβάλλον ανάπτυξης εφαρμογών σε αυτό.Το σύστημα ελέγχου εκδόσεων git.Το Διαδίκτυο των Πραγμάτων.Το πρωτόκολλο ανταλλαγής μηνυμάτων MQ Telemetry Transport (MQTT) καθώς λογισμικά/περιβάλλοντα ανάπτυξης για το ΜQTT.",
        "id": 15104143
      },
    {
        "subjectName": "Διδακτική της Πληροφορικής",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS/CET",
        "Professor": "Γόγουλου Αγορίτσα, Γρηγοριάδου Μαρία",
        "Hours": 4,
        "Description": "Διδακτική της Πληροφορικής μελετά το εκπαιδευτικό περιβάλλον μέσα στο οποίο πραγματοποιείται η οικοδόμηση γνώσεων που αφορούν διαχρονικές έννοιες της Πληροφορικής καθώς και η καλλιέργεια σχετικών δεξιοτήτων. Στο πλαίσιο αυτό εξετάζονται θέματα που αφορούν στη διδασκαλία βασικών εννοιών και κυρίως του προγραμματισμού, εναλλακτικές διδακτικές προσεγγίσεις και εκπαιδευτικά περιβάλλοντα/εργαλεία καθώς και θέματα κατανόησης κειμένου, σχεδιασμού μαθησιακών δραστηριοτήτων και αξιολόγησης. Το περιεχόμενο του μαθήματος αφορά: Βασικές έννοιες της Διδακτικής, Η έννοια της αναπαράστασης και της γνωστικής σύγκρουσης, Αλγοριθμική & υπολογιστική σκέψη, Τα Προγράμματα Σπουδών στο Γενικό Λύκειο και στην Τεχνική Εκπαίδευση, Διδακτική του Προγραμματισμού, Παρανοήσεις και Μαθησιακές Δυσκολίες, Διδακτικές Προσεγγίσεις, Δομημένος Προγραμματισμός, Αντικειμενοστραφής Προγραμματισμός, Εκπαιδευτικά Προγραμματιστικά Περιβάλλοντα για την Πρωτοβάθμια & τη Δευτεροβάθμια Εκπαίδευση, Εκπαιδευτικά Παιχνίδια, Εκπαιδευτική Ρομποτική, Η έννοια της αναλογίας και η αξιοποίησή της στη διδασκαλία εννοιών της Πληροφορικής, Εννοιολογική Χαρτογράφηση, Κατανόηση Κειμένου σε μαθήματα Πληροφορικής, Μορφές και εργαλεία αξιολόγησης, Το σχολικό εργαστήριο",
        "id": 15100450
      },
    {
        "subjectName": "Δομή και Θεσμοί της Ευρωπαϊκής Ένωσης",
        "semester": 7,
        "ECTS": 2,
        "Type": "Γενικής Παιδείας",
        "Kateythinsi": "-",
        "Professor": "Τολίδης Ιωάννης",
        "Hours": 2,
        "Description": "Το μάθημα παρουσιάζει τις σημαντικότερες πτυχές της ευρωπαϊκής οικονομικής και πολιτικής ολοκλήρωσης και καλύπτει τα παρακάτω θέματα: Βασικές έννοιες και μεθοδολογία προσέγγισης του ενωσιακού φαινομένου. Οικονομική ολοκλήρωση και πολιτική ενοποίηση. Βασικές θεωρίες για την πολιτική ενοποίηση (Ομοσπονδισμός, νεολειτουργισμός, αλληλεξάρτηση, θεωρία διεθνών καθεστώτων, διακυβερνητισμός), κριτική αξιολόγηση των θεωριών αυτών. Η έννομη τάξη της Ευρωπαϊκής Ένωσης, πρωτογενές και δευτερογενές δίκαιο. Θεσμική συγκρότηση, ανάπτυξη και εξέλιξη του θεσμικού συστήματος. Διαδικασίες διαμόρφωσης πολιτικής και λήψης αποφάσεων. Βασικές πολιτικές (οικονομική πολιτική, έρευνας, απασχόλησης και ένταξης στην αγορά εργασίας, εκπαίδευσης, επαγγελματικής κατάρτισης και δια βίου μάθησης). Διαθρωτικά ταμεία, χρηματοδοτήσεις και προγράμματα της Ευρωπαϊκής Ένωσης.",
        "id": 15100413
      },
    {
        "subjectName": "Ενισχυτική Μηχανική Μάθηση και Στοχαστικά Παίγνια",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "-",
        "Professor": "Νίκος Καλουπτσίδης",
        "Hours": 4,
        "Description": "-",
        "id": 15100810
      },
    {
        "subjectName": "Επικοινωνία Ανθρώπου Μηχανής",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Μαρία Ρούσσου",
        "Hours": 4,
        "Description": "Το μάθημα ΥΣ08 Επικοινωνία Ανθρώπου-Μηχανής καλύπτει ένα πλήθος από βασικά θέματα που αφορούν στην αλληλεπίδραση του ανθρώπου με τους υπολογιστές. Οι διαλέξεις δομούνται ως εξής: Εισαγωγή στην Επικοινωνία Ανθρώπου-Μηχανής (ΕΑΜ), χαρακτηριστικά του ανθρώπου που αφορούν την επικοινωνία του με τους υπολογιστές, αισθήσεις και αισθητήρια όργανα, όραση και οπτική αντίληψη, ακοή, κίνηση, ανθρώπινη μνήμη, μνήμη αισθήσεων και μνήμη εργασίας, λειτουργίες μακροπρόθεσμης μνήμης, μεταφορές, χαρακτηριστικά του υπολογιστή που αφορούν την επικοινωνία του με τους ανθρώπους, θέματα της επικοινωνίας των ανθρώπων με τις μηχανές, εργονομία, σχεδίαση διαλόγου, σχεδίαση οθόνης, βασικές αρχές χρηστικότητας που επηρεάζουν την δυνατότητα εκμάθησης, την ευελιξία, και την ευρωστία, κύκλος ανάπτυξης και ζωής λογισμικού επικοινωνίας ανθρώπου-μηχανής, τύποι επαναληπτικού σχεδιασμού και πρωτοτυποποίησης, μεθοδολογίες σχεδίασης (πληροφοριακά συστήματα βασισμένα σε θέματα, ανάλυση χώρου σχεδιασμού), ανάλυση απαιτήσεων και καταγραφή προδιαγραφών, οδηγίες και πρότυπα, μηχανική χρηστικότητας, σχεδίαση συστημάτων ΕΑΜ, μοντελοποίηση χρηστών (μοντέλο GOMS και μοντέλο KLM), σχεδιασμός διεπαφών τύπου Παράθυρα-Εικονίδια-Ποντίκια-Επιλογείς (ΠΕΠΕ) και για το Παγκόσμιο Πλέγμα Πληροφοριών, στοιχεία ΗΤΜL και Javascript, αξιολόγηση συστημάτων, οπτικοποίηση δεδομένων, μελλοντικές τάσεις.",
        "id": 15100301
      },
    {
        "subjectName": "Θεωρία Αριθμών",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Παρασκευή Ρούπα",
        "Hours": 4,
        "Description": "Το μάθημα καλύπτει βασικά και προχωρημένα θέματα της Θεωρίας Αριθμών. Πρώτοι αριθμοί. Θεώρημα του Ευκλείδη. Κριτήρια για πρώτους και για σύνθετους αριθμούς. Διαιρετότητα. Αλγόριθμος της διαίρεσης. Ελάχιστο κοινό πολλαπλάσιο (Ε.Κ.Π.) και Μέγιστος κοινός διαιρέτης (Μ.Κ.Δ.). Θεμελιώδες Θεώρημα της Αριθμητικής. Τέλειοι αριθμοί. Θεώρημα Ευκλείδη. Θεώρημα Euler. Συναρτήσεις. Συνάρτηση ακεραίου μέρους. Αριθμητική συνάρτηση. Συνάρτηση Möbius. Συνάρτηση Euler. Πολλαπλασιαστική συνάρτηση. Περιοδική συνάρτηση. Ισοδυναμίες. Γραμμικές ισοδυναμίες. Συστήματα γραμμικών ισοδυναμιών. Τετραγωνικά υπόλοιπα. Σύμβολο Legendre. Διοφαντικές Εξισώσεις και εφαρμογές αυτών.",
        "id": 15100480
      },
    {
        "subjectName": "Οπτικές Επικοινωνίες και Οπτικά Δίκτυα",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Γεώργιος Κανέλλος, Συβρίδης Δημήτριος",
        "Hours": 4,
        "Description": "Βασικά δομικά και λειτουργικά χαρακτηριστικά συστημάτων οπτικών επικοινωνιών και δικτύων. Χαρακτηριστικά διάδοσης σημάτων σε οπτική ίνα, οπτικοί πομποί, οπτικοί ενισχυτές, οπτικά φίλτρα, φωτοδέκτες. Αρχιτεκτονικές συστημάτων οπτικών επικοινωνιών, σχήματα διαμόρφωσης/αποδιαμόρφωσης. Γραμμικά και μη γραμμικά συστήματα οπτικών επικοινωνιών υψηλού ρυθμού. Συστήματα οπτικής πολυπλεξίας χρόνου και πολυπλεξίας μήκους κύματος. Βασικές αρχιτεκτονικές οπτικών μητροπολιτικών και δικτύων κορμού.",
        "id": 15100207
      },
    {
        "subjectName": "Προηγμένα Θέματα Αλγορίθμων",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Νάκος Βασίλειος",
        "Hours": 4,
        "Description": "Προηγμένα Θέματα Αλγορίθμων τα οποία καλύπτουν:δομές δεδομένων.Γραφήματα, με έμφαση στα συντομότερα μονοπάτια και σε μέγιστες ροές και ελάχιστες αποκοπές σε δίκτυο.Γρήγορο Μετασχηματισμό Fourier συνελίξεις.τυχαιοποιημένους αλγόριθμους, κατακερματισμός, γρήγορη ταξινόμηση.γραμμικό προγραμματισμό.δυναμικό προγραμματισμό.προσεγγιστικούς αλγόριθμους.Αλγόριθμους αριθμητικής βελτιστοποίησης.",
        "id": 15100470
      },
    {
        "subjectName": "Προηγμένοι Επιστημονικοί Υπολογισμοί",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Φίλιππος Τζαφέρης, Μισυρλής Νικόλαος",
        "Hours": 4,
        "Description": "Μέρος Ι Αριθμητικές μέθοδοι για την επίλυση Συνήθων Διαφορικών Εξισώσεων : μέθοδοι Euler, Taylor, Σφάλματα αποκοπής και στρογγύλευσης, Συμβατότητα, Σύγκλιση και Ευστάθεια. Runge-Kutta τάξης ακρίβειας δύο, τρία και τέσσερα, Σφάλματα και Ευστάθεια. Μέθοδοι Πολλαπλού βήματος : Adams-Bashforth, Πρόβλεψης-Διόρθωσης, Συμβατότητα, Σύγκλιση και Δυσκαμψία. Προβλήματα συνοριακών τιμών: Μέθοδος των πεπερασμένων διαφορών.Μέρος ΙΙ Εισαγωγή στις πεπερασμένες διαφορές. Αριθμητική επίλυση Παραβολικών Εξισώσεων: Άμεσες Μέθοδοι, Μέθοδος Crank-Nicolson, Σύγκλιση, Ευστάθεια. Δυδιάστατες Παραβολικές Εξισώσεις: Άμεσες Μέθοδοι, Επαναληπτικές Μέθοδοι (ADI), Τρισδιάστατες Παραβολικές Εξισώσεις, Αριθμητική επίλυση Ελλειπτικών Εξισώσεων, Επαναληπτικές Μέθοδοι, Αριθμητική επίλυση Υπερβολικών Εξισώσεων, Άμεσες Μέθοδοι, Επαναληπτικές Μέθοδοι.",
        "id": 15100494
      },
    {
        "subjectName": "Συστήματα Κινητών και Προσωπικών Επικοινωνιών",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Νίκος Πασσάς",
        "Hours": 4,
        "Description": "Είναι μάθημα επιλογής κατεύθυνσης του τομέα Επικοινωνιών και Επεξεργασίας Σήματος. Προσφέρεται στο 7ο (χειμερινό) εξάμηνο με τρεις ώρες θεωρία και μια ώρα εργαστήριο. Για πρακτικούς λόγους τα εργαστήρια γίνονται όλα μαζί στο τέλος του εξαμήνου. Χρήσιμο για την ευχερέστερη κατανόηση του μαθήματος είναι ο φοιτητής να έχει προηγουμένως πάρει τα μαθήματα Δίκτυα Επικοινωνιών Ι και ΙΙ.Το μάθημα έχει οργανωθεί σε δύο κύριες ενότητες: α) γενικές αρχές ασύρματων και κυψελωτών συστημάτων και β) σύντομη περιγραφή σύγχρονων συστημάτων κυψελωτών επικοινωνιών (με έμφαση στα συστήματα GSM, UMTS, LTE). Οι εργαστηριακές ασκήσεις γίνονται στο τελευταίο μέρος του μαθήματος και περιλαμβάνουν σύντομες παρουσιάσεις σε θέματα σχετικά με την ύλη που διδάσκεται.",
        "id": 15100154
      },
    {
        "subjectName": "Συστήματα Ψηφιακής Επεξεργασίας Σημάτων σε Πραγματικό Χρόνο",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Αλέξανδρος Πίνο",
        "Hours": 4,
        "Description": "Θεωρία και αρχιτεκτονική συστημάτων ψηφιακής επεξεργασίας σημάτων σε πραγματικό χρόνο. Σύνδεση υπολογιστή με τον αναλογικό κόσμο. Αναλογικό μέρος - προεπεξεργασία σημάτων. Αισθητήρες και μετατροπείς (εισόδου και εξόδου). Ψηφιο-αναλογική μετατροπή. Αναλογικο-ψηφιακή μετατροπή. Συστήματα συλλογής δεδομένων και συστήματα ελέγχου. Ιδεατά όργανα μέτρησης (virtual intstuments), φίλτρα, συναρτήσεις παραθύρου, προσαρμογή δεδομένων. Τεχνικές προγραμματισμού και ανάπτυξης εφαρμογών στη γλώσσα G (περιβάλλον LabVIEW) για: α) έλεγχο διαδικασιών, β) εφαρμογές μετρήσεων και δοκιμών, γ) επιστημονικούς υπολογισμούς, δ) ψηφιακή επεξεργασία σημάτων (ΨΕΣ) και ε) δημιουργία ιδεατών οργάνων μετρήσεων και ελέγχου.",
        "id": 15100303
      },
    {
        "subjectName": "Σχεδίαση VLSI Κυκλωμάτων",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Νικάς Θωμάς",
        "Hours": 4,
        "Description": "Τεχνολογία κατασκευής Ολοκληρωμένων Κυκλωμάτων (Ο.Κ.) (ανάπτυξη κρυστάλλων, κατασκευή δισκιδίων, επιταξία, οξείδωση, διάχυση, εμφύτευση ιόντων, απόθεση στιβάδων), μέθοδοι σχεδίασης φυσικού αναπτύγματος (layout) Ο.Κ., κανόνες φυσικής σχεδίασης nMOS και CMOS, μικρολιθογραφία. Μοντέλα DC λειτουργίας των MOSFET. Βασικά ψηφιακά Ο.Κ. MOSFET (αναστροφέας, πύλη διέλευσης, συνδυαστικά κυκλώματα, ακολουθιακά, μνήμες). Αρχές πόλωσης των MOSFET (κυκλώματα πόλωσης τάσης, πηγές ρεύματος και ενεργοί φόρτοι). Ενισχυτές με μία και περισσότερες βαθμίδες (μοντέλα μικρού σήματος, βασικές αναλογικές δομικές βαθμίδες ενισχυτών, διαφορικός ενισχυτής, τελεστικός ενισχυτής). Απόκριση κατά συχνότητα των κυκλωμάτων με MOSFET (ισοδύναμα κυκλώματα Υ.Σ., αντιστάθμιση συχνότητας). Κυκλώματα διακοπτόμενων πυκνωτών (switched – capacitor  circuits) (αρχή λειτουργίας, εφαρμογές). Πρακτική εξάσκηση στη σχεδίαση φυσικού αναπτύγματος και στη σχεδίαση και προσομοίωση Ο.Κ. σε επίπεδο ηλεκτρονικού κυκλώματος.",
        "id": 15100411
      },
    {
        "subjectName": "Τεχνητή Νοημοσύνη IΙ",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Μανόλης Κουμπαράκης",
        "Hours": 4,
        "Description": "Το μάθημα επικεντρώνεται στην μελέτη τεχνικών βαθιάς μάθησης (deep learning) και την χρήση τους για την επίλυση προβλημάτων επεξεργασίας φυσικής γλώσσας (natural language processing).Τα θέματα που καλύπτονται είναι: introduction to machine learning, regression, perceptron, neural networks, backpropagation, word vectors, word2vec and related models, dependency parsing, language modeling and RNNs, vanishing gradients and fancy RNNs, machine translation, seq2seq and attention, question answering, convolutional networks for NLP, contextual word embeddings, transformers, BERT and related models, natural language generation, question answering for knowledge graphs.Οι εργασίες του μαθήματος θα γίνουν σε Python/TensorFlow/PyTorch.",
        "id": 15100442
      },
    {
        "subjectName": "Τεχνολογίες της Πληροφορίας και των Επικοινωνιών (ΤΠΕ) στη Μάθηση",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS/CET",
        "Professor": "Γόγουλου Αγορίτσα, Γρηγοριάδου Μαρία",
        "Hours": 4,
        "Description": "Σκοπός του μαθήματος είναι οι φοιτητές (α) να γνωρίσουν εκπαιδευτικά περιβάλλοντα και μαθησιακά εργαλεία και να συζητήσουν/ σχολιάσουν τρόπους αξιοποίησής τους στη διδακτικό-μαθησιακή διαδικασία μέσα από συγκεκριμένα παραδείγματα, και (β) να εντρυφήσουν στο σχεδιασμό μαθήματος, στο σχεδιασμό σεναρίων και στο σχεδιασμό μαθησιακών δραστηριοτήτων αξιοποιώντας εκπαιδευτικά περιβάλλοντα. Το περιεχόμενο του μαθήματος αφορά: Θεωρίες Μάθησης, Στρατηγικές Διδασκαλίας, Οργάνωση και Σχεδίαση Μαθήματος, Πρόγραμμα Σπουδών – Σχολικά Εγχειρίδια – Διαθεματικότητα – Διεπιστημονικότητα, Επισκόπηση Προγραμμάτων Σπουδών του Πληροφορικού Γραμματισμού και των ΤΠΕ, Το μοντέλο της Τεχνολογικής Παιδαγωγικής Γνώσης Περιεχομένου & Σχεδιασμός Εκπαιδευτικών Σεναρίων, Εκπαιδευτικά περιβάλλοντα και εφαρμογές των ΤΠΕ που βασίζονται στις θεωρίες μάθηση, Μαθησιακά Αντικείμενα - Ψηφιακό Υλικό για μαθήματα Πληροφορικής και ΤΠΕ, Μοντέλα ένταξης των ΤΠΕ στην εκπαίδευση, Αξιοποίηση του Web και των εργαλείων του στη διδασκαλία της Πληροφορικής, Ιστοεξερευνήσεις, Διδακτική προσέγγιση λογισμικών γενικής χρήσης",
        "id": 15100122
      },
    {
        "subjectName": "Υπολογιστική Πολυπλοκότητα",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS/CET",
        "Professor": "Αρχοντία Γιαννοπούλου",
        "Hours": 4,
        "Description": "Μηχανές Turing (Μ.Τ.) (πολυταινιακές Μ.Τ., μη-ντετερμινιστικές Μ.Τ.). Η θέση Church-Turing.  Σχέση πολυπλοκότητας μεταξύ μοντέλων (Μ.Τ., πολυταινιακών Μ.Τ. και μη-ντετερμινιστικών Μ.Τ.). Χρονική πολυπλοκότητα μη-ντετερμινιστικών Μ.T.. Η κλάση P. Η κλάση NP. Συντακτικός ορισμός της κλάσης NP. Η κλάση CO-NP. Η κλάση EXP. Αναγωγές και πληρότητα, η έννοια της NP-δυσκολίας. Το θεώρημα Cook-Levin. NP-πλήρεις γλώσσες. Ψευδοπολυωνυμικότητα και ισχυρά NP-πλήρεις γλώσσες. Το θεώρημα του Savitch. H κλάση PSPACE. PSPACE πληρότητα. Οι κλάσεις L, NL και EXPSPACE. NL πληρότητα. Το θεώρημα χωρικής Ιεραρχίας. Το θεώρημα χρονικής Ιεραρχίας.",
        "id": 15100804
      },
    {
        "subjectName": "Ψηφιακές Επικοινωνίες",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Αρχοντία Γιαννοπούλου",
        "Hours": 4,
        "Description": "Ψηφιακή Διαμόρφωση, Ψηφιακές Διαμορφώσεις Σημάτων Υψηλής Φασματικής Αποδοτικότητας, Ψηφιακές Επικοινωνίες σε Κανάλια με Δια-Συμβολική Παρεμβολή, Συγχρονισμός στις Ψηφιακές Επικοινωνίες",
        "id": 15100137
      },
    {
        "subjectName": "Ψηφιακή Προσβασιμότητα και Υποστηρικτικές Τεχνολογίες Πληροφορικής",
        "semester": 7,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS/CET",
        "Professor": "Γεώργιος Κουρουπέτρογλου, Αλέξανδρος Πίνο",
        "Hours": 4,
        "Description": "Διαστάσεις διαφοροποίησης χρηστών. Ανάλυση αναγκών ατόμων με αισθητηριακή (όραση, ακοή, αφή), κινητική (μετακίνηση, δεξιότητα, τέντωμα/φτάσιμο) και γνωσιακή (νοητικές λειτουργίες-επικοινωνία) αναπηρία. Μοντελοποίηση και μετρικές αναπηριών βασισμένα στα πρότυπα του Παγκόσμιου Οργανισμού Υγείας. Αρχές καθολικής σχεδίασης. Ο νόμος 80/20 (αρχή Pareto). Τεχνικές, συσκευές και λογισμικό προσβάσιμης αλληλεπίδρασης – Υποστηρικτικές Τεχνολογίες Πληροφορικής για άτομα με αναπηρία. Oι νόμοι Fitts και Hick. Εφαρμογή της σχεδίασης για όλους για προσβασιμότητα πολυμεσικού περιεχομένου. Κύκλος ζωής προσβάσιμων συστημάτων πληροφορικής βασισμένων σε συστατικά (component-based). Καθολική Σχεδίαση για Μάθηση. Διεθνείς τυποποιήσεις και πρότυπα προσβασιμότητας και χρηστικότητας. Η πρωτοβουλία για προσβασιμότητα (WAI) της Κοινοπραξίας του Παγκόσμιου Ιστού (W3C). Οδηγίες για την Προσβασιμότητα του Περιεχομένου του Παγκόσμιου Ιστού. Νομικές υποχρεώσεις για προσβασιμότητα στο Διαδίκτυο. Ανάπτυξη προσβάσιμων ιστοθέσεων. Εργαλεία αποτίμησης και αξιολόγησης προσβασιμότητας ιστοθέσεων.",
        "id": 15100517
      },
    {
        "subjectName": "Ανάπτυξη Υλικού-Λογισμικού για Ενσωματωμένα Συστήματα",
        "semester": 8,
        "ECTS": 8,
        "Type": "Project",
        "Kateythinsi": "CET",
        "Professor": "Ηλίας Μανωλάκος",
        "Hours": 6,
        "Description": "Τα Ενσωματωμένα Συστήματα (ΕΣ) είναι συστήματα του κόσμου όπου συναντώνται και ολοκληρώνονται σε ένα αποδοτικό σύστημα ειδικού σκοπού με τον βέλτιστο τρόπο επεξεργαστές, αισθητήρες, περιφερειακά και λογισμικό. Το μάθημα καλύπτει τη συσχεδίαση Yλικού / Λογισμικού για αποδοτικά ΕΣ ως προς τη θεωρία αλλά και την εφαρμογή της στο εργαστήριο με τη χρήση κάρτας FPGA με ενσωματωμένο επεξεργαστή. Καλύπτει: Tεχνολογίες υλοποίησης ΕΣ (μικροελεγκτές, FPGAs, υβριδικές). Πυρήνες πνευματικής ιδιοκτησίας (IP cores) και τρόπους διασύσνδεσής τους, Systems on Chip, Networks on Chip. Ενσωματωμένο λογισμικό, τεχνικές διαχείρισης πολλαπλών διεργασιών, πυρήνες λειτουργικών συστημάτων πραγματικού χρόνου. Ιεραρχική σχεδίαση ενσωματωμένων συστημάτων με χρήση γλωσσών περιγραφής υλικού (VHDL). Τεχνικές αποδοτικής σύνθεσης υλικού, εργαλεία σύνθεσης. Τεχνικές ελαχιστοποίησης της κατανάλωσης ενέργειας. Σχεδίαση ενσωματωμένων συστημάτων που συνδυάζουν επεξεργαστές γενικού και ειδικού σκοπού στο ίδιο ολοκληρωμένο κύκλωμα (Multiprocessor Systems on Chip). Μοντελοποίηση και προσομοίωση ΕΣ. Παραδείγματα σχεδίασης ΕΣ για εφαρμογές στις τηλεπικοινωνίες, τη ψηφιακή επεξεργασία σημάτων και εικόνων, τη ρομποτική. Aσύρματα δίκτυα αισθητήρων, δικτυωμένα ΕΣ, Διαδίκτυο των Πραγμάτων (Internet of Things). Υπολογιστικά ΕΣ για τεχνητή νοημοσύνη. Στο Εργαστήριο: Σταδιακή σχεδίαση με χρήση VHDL και υλοποίηση σε FPGA προγραμματιζόμενου πολυεπεξεργαστικού ενσωματωμένου συστήματος σε ψηφίδα (System on Chip).",
        "id": 1510414
      },
    {
        "subjectName": "Ασύρματες Zεύξεις",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Νίκος Πασσάς",
        "Hours": 4,
        "Description": "Στο μάθημα παρουσιάζεται και αναλύεται η συμπεριφορά των ηλεκτρομαγνητικών κυμάτων στην ατμόσφαιρα, στο διάστημα, στα εξωτερικά και εσωτερικά περιβάλλοντα λειτουργίας των κινητών επικοινωνιών, και μελετώνται δημοφιλή μοντέλα διάδοσης. Το μάθημα αυτό παρουσιάζει θεμελιώδεις έννοιες για την κατανόηση, την αξιολόγηση και την πρόβλεψη των αποτελεσμάτων της διάδοσης των ηλεκτρομαγνητικών κυμάτων σε όλο το ραδιοφάσμα και σε διάφορα σενάρια.",
        "id": 15100437
      },
    {
        "subjectName": "Διοίκηση Έργων και Τεχνικές Παρουσίασης και Συγγραφής Επιστημονικών Εκθέσεων",
        "semester": 8,
        "ECTS": 2,
        "Type": "Γενικής Παιδείας",
        "Kateythinsi": "-",
        "Professor": "Τολίδης Ιωάννης",
        "Hours": 2,
        "Description": "Το μάθημα περιλαμβάνει τον βασικό κορμό γνώσεων και δεξιοτήτων στη Διοίκηση Έργων και καλύπτει τα παρακάτω θέματα: Εισαγωγή στη Διοίκηση - Διαχείριση των έργων - βασικές έννοιες. Κύκλος ζωής, φάσεις και βασικά στοιχεία στη Διοίκηση Έργων. Περιβάλλον των έργων, ενδιαφερόμενα μέρη, ρόλοι και υπευθυνότητες. Οργανωτικές δομές στην εκτέλεση των έργων. Επιλογή των έργων - μέθοδοι επιλογής (Ανάλυση κόστους όφελος, περίοδος αποπληρωμής επενδυμένων κεφαλαίων, απόδοση της επένδυσης, καθαρή παρούσα αξία). Δομική ανάλυση των έργων. Χρονικός προγραμματισμός, μέθοδοι προγραμματισμού. Προγραμματισμός και κατανομή πόρων, τύποι πόρων. Οικονομική προσέγγιση των έργων - κοστολόγηση. Διαχείριση κινδύνων και αβεβαιότητας (αναγνώριση κινδύνων, αποτίμηση, σχέδιο διαχείρισης). Παρακολούθηση και έλεγχος των έργων, τεχνικές και περιεχόμενο ελέγχου. Αξιολόγηση των έργων.",
        "id": 15100454
      },
    {
        "subjectName": "Ειδικά Θέματα Υπολογιστικών Συστημάτων και Εφαρμογών: Υπολογιστικά Συστήματα Μεγάλης Κλίμακας",
        "semester": 8,
        "ECTS": 4,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Γκιζόπουλος Δημήτρης",
        "Hours": 4,
        "Description": "Ο σκοπός αυτού του μαθήματος είναι να εξετάσει τα βασικά συστατικά των σύγχρονων υπολογιστικών συστημάτων μεγάλης κλίμακας, με ιδιαίτερη έμφαση στα μεγάλα κέντρα δεδομένων (warehouse scale computers, data centers): εφαρμογές, προγραμματιστικά μοντέλα, λογισμικό (γενικές αρχές εικονικοποίησης, cloud computing, serverless computing, παρακολούθηση και διαχείριση πόρων), υλικό (επεξεργαστές, επιταχυντές, αρχιτεκτονικές συγκεκριμένου τομέα, δίκτυα επικοινωνίας, αποθήκευση), κατασκευή, παροχή ενέργειας, και ψύξη, επίδοση και ενεργειακή αποδοτικότητα, μοντελοποίηση, αξιοπιστία, αστοχίες και διόρθωση. Ιδιαίτερη έμφαση θα δοθεί τόσο στο λογισμικό, όσο και στο υλικό, αλλά και στη διασύνδεση τους.",
        "id": 15100813
      },
    {
        "subjectName": "Επεξεργασία Εικόνας",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Σπύρος Πολυχρονόπουλος",
        "Hours": 4,
        "Description": "Στοιχεία συστημάτων ψηφιακής επεξεργασίας εικόνας και βασικές έννοιες. Βασικοί δισδιάστατοι μετασχηματισμοί και αναπαραστάσεις εικόνας (Fourier, Walsh Hadamard, KL μετασχηματισμός διακριτού συνημιτόνου (DCT), γρήγορες υλοποιήσεις, αναπαράσταση εικόνας στο MATLAB, βασικές εντολές χειρισμού εικόνων στο MATLAB. Βελτίωση εικόνας (μετασχηματισμοί έντασης, εξισορρόπηση ιστογράμματος, χωρικά φίλτρα, φίλτρα επιλογής συχνοτήτων, ομομορφικά φίλτρα). Επεξεργασία έγχρωμης εικόνας (βασικά χρωματικά υποδείγματα, ψευδοχρωματισμός, επεξεργασία πλήρους χρώματος, βασικές εντολές στο MATLAB). Aποκατάσταση εικόνας (υποδείγματα παραμορφώσεων, αντίστροφα φίλτρα και φιλτρο Wiener, προσαρμοστικό φίλτρο Wiener, βασικές εντολές στο MATLAB). Συμπίεση και κωδικοποίηση (Μορφές πληροφοριακού πλεονάσματος και κριτήρια πιστότητας, σχεδιασμός κβαντιστών Max Loyd, υποδείγματα συμπίεσης και κωδικοποίησης (προγνωστική κωδικοποίηση, DPCM, κα, συμπίεση με/χωρίς απώλειες, standards βασικές εντολές στο MATLAB). Κατάτμηση εικόνας (ανίχνευση ασυνεχειών σημείου ευθείας ακμών, μετασχηματισμός Hough, κατωφλίωση, κατάτμηση με περιοχές, κωδικοποίηση αλυσίδας, περιγραφείς συνόρου, υφή, μορφολογική επεξεργασία).",
        "id": 15100067
      },
    {
        "subjectName": "Θεωρία Γραφημάτων",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Κολλιόπουλος Σταύρος",
        "Hours": 4,
        "Description": "Μονοπάτια, δέντρα. Κορυφοδιαχωριστές, ακμοδιαχωριστές, συνεκτικότητα. Θεώρημα του Menger. Ταιριάσματα. Θεώρημα του Tutte. Καλύμματα κορυφών. Επιπεδότητα, εξωεπιπεδότητα. Μοναδικές Εμβαπτίσεις. Θεώρημα του Whitney. Πλάτος μονοπατιού, δενδροπλάτος. Χρωματισμός γραφημάτων. Θεώρημα του Brooks. Κατασκευή Mycielski.",
        "id": 15100143
      },
    {
        "subjectName": "Ιστορία της Πληροφορικής και των Τηλεπικοινωνιών",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS/CET",
        "Professor": "Τέλης Τύμπας",
        "Hours": 3,
        "Description": "Μάθημα εισαγωγής στην ιστορία ενός επιστημονικού και τεχνολογικού πεδίου που διαδραματίζει κομβικό ρόλο στην διαμόρφωση του συνόλου της σύγχρονης επιστήμης και τεχνολογίας, το οποίο είναι γνωστό ως Τεχνολογίες Πληροφορικής και Τηλεπικοινωνιών. Περιλαμβάνει, μεταξύ άλλων, την Ιστορία της Υπολογιστικής Επιστήμης και Τεχνολογίας, την Ιστορία της Επιστήμης και της Τεχνολογίας της Τηλεπικοινωνίας (και γενικότερα της Επικοινωνίας), την Ιστορία του Αυτοματισμού, την Ιστορία της Ηλεκτρονικής.",
        "id": 15100418
      },
    {
        "subjectName": "Καινοτομία και Επιχειρηματικότητα",
        "semester": 8,
        "ECTS": 4,
        "Type": "Προαιρετικό",
        "Kateythinsi": "-",
        "Professor": "Τολίδης Ιωάννης",
        "Hours": 3,
        "Description": "Το μάθημα περιλαμβάνει το βασικό κορμό γνώσεων και δεξιοτήτων στα πεδία της επιχειρηματικότητας και της  καινοτομίας και καλύπτει τα παρακάτω θέματα: Έννοια και σημασία της επιχειρηματικότητας και της καινοτομίας. Επιχειρηματικό και οικονομικό περιβάλλον. Επιχειρηματική ευκαιρία, αβεβαιότητα, επιχειρηματικός κίνδυνος και λήψη απόφασης. Επιχειρηματικές δεξιότητες, το προφίλ του επιχειρηματία. Ο κύκλος της επιχειρηματικής διαδικασίας (σύλληψη επιχειρηματικής ιδέας, αξιολόγηση επιχειρηματικής ευκαιρίας, ανάπτυξη επιχειρηματικού μοντέλου, δημιουργία επιχειρηματικού σχεδίου, πηγές χρηματοδότησης). Ίδρυση επιχείρησης. Διεθνής επιχειρηματικότητα. Κοινωνική Επιχειρηματικότητα. Εταιρική κοινωνική ευθύνη και επιχειρηματική ηθική. Εθνικές πολιτικές για την επιχειρηματικότητα και κοινοτικές δράσεις.",
        "id": 15100440
      },
    {
        "subjectName": "Κρυπτογραφία",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Χάιδος Πύρρος",
        "Hours": 4,
        "Description": "-",
        "id": 15100419
      },
    {
        "subjectName": "Μικροοικονομική Ανάλυση",
        "semester": 8,
        "ECTS": 4,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS/CET",
        "Professor": "Κατσιάνης Δημήτριος",
        "Hours": 3,
        "Description": "Το μάθημα περιλαμβάνει το βασικό κορμό γνώσεων και δεξιοτήτων στο πεδίο της μικροοικονομικής και καλύπτει τα παρακάτω θέματα: Η Αγορά και ισορροπία, Θεωρία Ζήτησης, Θεωρία της επιχείρησης, Μονοπώλιο, Μονοπωλιακή Συμπεριφορά, Ολιγοπώλιο, Τεχνολογία Πληροφοριών, Εξωτερικότητες.",
        "id": 15101185
      },
    {
        "subjectName": "Μουσική Πληροφορική",
        "semester": 8,
        "ECTS": 4,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CET",
        "Professor": "Σπύρος Πολυχρονόπουλος",
        "Hours": 3,
        "Description": "Ιστορική ανασκόπηση, ήχος και ακουστική χώρου, μικρόφωνα και ηχεία, μετατροπή αναλογικού σε ψηφιακού σήματος, dithering, format αρχείων για ήχο και μουσική, αναλογικοί και ψηφιακοί μίκτες/κονσόλες, αλγόριθμοι εφφέ, sequencers και samplers, Digital Audio Workstations (DAW), mastering, αλγόριθμοι σύνθεσης μουσικής, ανάκτηση μουσικής πληροφορίας, διαδραστικά συστήματα MIDI interfaces και Open Sound Control, ψηφιακά εικονικά μουσικά όργανα, αλγοριθμική δόμηση ηχητικών μονάδων, διεπαφή ανθρώπου-μηχανής σε ψηφιακά μουσικά περιβάλλοντα, εισαγωγή στις μεθοδολογίες Ανάκτησης Μουσικής Πληροφορίας, συστήματα ψηφιακής επεξεργασίας σημάτων μουσικής. Προγραμματιστικά περιβάλλοντα MATLAB και Pure Data παραδείγματα σε όλα τα κεφάλαια του μαθήματος.",
        "id": 15100424
      },
    {
        "subjectName": "Προστασία και Ασφάλεια Υπολογιστικών Συστημάτων",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Κώστας Χατζηκοκολάκης",
        "Hours": 4,
        "Description": "Εισαγωγή στην ασφάλεια. Βασικοί ορισμοί, συνηθισμένες απειλές στην ασφάλεια, ειδικές απαιτήσεις για δικτυακά περιβάλλοντα. Προσεγγίσεις στην επίτευξη ασφάλειας. Μηχανισμοί προστασίας, διακρίβωση ταυτότητας, έλεγχος προσπέλασης, τεχνικές διασφάλισης. Προστασία υπολογιστικών πόρων στο διαδίκτυο. Firewalls, περιτυλίγματα υπηρεσιών και συναφείς τεχνικές. Εισαγωγή στην κρυπτογραφία και τη διαχείριση κλειδιών. Κρυπτογραφία, συμμετρικοί και ασύμμετροι αλγόριθμοι, διακρίβωση δημόσιων κλειδιών, διαχείριση κλειδιών, ψηφιακές υπογραφές, αναφορές σε τεχνικές κρυπτανάλυσης. Ασφάλεια χρηστών στο διαδίκτυο. Κίνδυνοι από ενεργό περιεχόμενο που διακινείται στο διαδίκτυο και τρόποι προστασίας. Πλαίσιο ασφάλειας για τις γλώσσες Javascript και Java.Το πρόβλημα των ιών. Τι είναι ιός, είδη ιών, τρόποι μόλυνσης, τεχνικές που χρησιμοποιούν οι ιοί, λογισμικό και μέθοδοι αντιμετώπισης των ιών. Εργαλεία ανίχνευσης ευπαθειών. Γενικοί ορισμοί, ο ρόλος τους, μέθοδοι ελέγχου, παραδείγματα. Συστήματα ανίχνευσης εισβολών. Λόγοι χρήσης, γενικό μοντέλο, αρχιτεκτονική των συστημάτων, ειδικά χαρακτηριστικά και τεχνικές, τρόποι αντίδρασης.",
        "id": 15100309
      },
    {
        "subjectName": "Σημασιολογία Γλωσσών Προγραμματισμού",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Ροντογιάννης Παναγιώτης",
        "Hours": 4,
        "Description": "-",
        "id": 15100809
      },
    {
        "subjectName": "Σχολική Τάξη & Μικροδιδασκαλία",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS/CET",
        "Professor": "Αγορίτσα Γόγουλου",
        "Hours": 4,
        "Description": "Ο υποψήφιος εκπαιδευτικός, εκτός από δεξιότητες στον μαθησιακό σχεδιασμό, είναι σημαντικό να γνωρίζει τα χαρακτηριστικά και τις συνιστώσες της σχολικής τάξης και της σχολικής κοινότητας γενικότερα και να αναπτύξει δεξιότητες στην υλοποίηση διδασκαλίας. Στο πλαίσιο του μαθήματος εξετάζονται σχετικά θέματα όπως: Οι εκπαιδευτικοί και το έργο τους, Οργάνωση και διοίκηση της σχολικής τάξης, Η σχολική τάξη ως κοινότητα ενδιαφέροντος, Οργάνωση και λειτουργία των σχολικών μονάδων, Οργάνωση - Σχεδιασμός της διδασκαλίας, Διαπροσωπικές σχέσεις στην τάξη, Η αξιολόγηση στην εκπαίδευση, Η καλλιέργεια της κριτικής και δημιουργικής σκέψης, Πλαίσιο σχεδιασμού και εφαρμογής μικροδιδασκαλίας, Υλοποίηση μικροδιδασκαλίας Παρατήρηση, ανάλυση και αξιολόγηση της μικροδιδασκαλίας.",
        "id": 15100518
      },
    {
        "subjectName": "Τεχνολογία Λογισμικού",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Κώστας Σαΐδης",
        "Hours": 4,
        "Description": "Το μάθημα αποτελεί μια εισαγωγή στην Τεχνολογία Λογισμικού, αναδεικνύοντας τα ζητήματα σχεδιασμού, διαχείρισης, ελέγχου και διοίκησης λογισμικού που ανακύπτουν κατά την ανάπτυξη σύνθετων έργων λογισμικού και παρουσιάζει τις πλέον σύγχρονες πρακτικές αντιμετώπισής τους, όπως αυτές απαντώνται στη βιβλιογραφία και στη βιομηχανία. Στο πλαίσιο του μαθήματος καλύπτονται βασικά ζητήματα του κύκλου ζωής του λογισμικού και των μεθοδολογιών ανάπτυξης λογισμικού, δίνοντας έμφαση: (α) στην ευέλικτη μεθοδολογία και ειδικά στην τεχνική Scrum, (β) στη μεθοδολογία DevOps και ειδικά στη διαχείριση των εκδόσεων του λογισμικού και στην αυτοματοποίηση του «χτισίματός» του και της διενέργειας των σεναρίων ελέγχου. Το μάθημα, επίσης, καταπιάνεται με ζητήματα σχεδιασμού και αρχιτεκτονικής σύνθετου κατανεμημένου λογισμικού, καλύπτοντας θέματα ανάλυσης και μοντελοποίησης απαιτήσεων, αντικειμενοστραφούς σχεδιασμού και αρχιτεκτονικών και σχεδιαστικών προτύπων, δίνοντας έμφαση στις αρχιτεκτονικές επιλογές που προκύπτουν βάση του θεωρήματος CAP. Στο μάθημα, τέλος, καλύπτονται και οι πλέον σύγχρονες τεχνικές δημιουργίας γραφικών διεπαφών χρήστη στο διαδίκτυο.",
        "id": 15100168
      },
    {
        "subjectName": "Υπολογιστική Γεωμετρία",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Παρασκευή Ρούπα",
        "Hours": 4,
        "Description": "Εισαγωγή στους Γεωμετρικούς Αλγόριθμους και προεκτάσεις προς τις ερευνητικά ενεργές περιοχές της Υπολογιστικής Γεωμετρίας. Eιδικότερα:Kυρτότητα σε δύο διαστάσεις και σε τρεις διαστάσεις, αλλά και σε γενική διάσταση.Όγκος κυρτών πολυέδρων και Minkowski άθροισμα Πολυέδρων.Τριγωνοποίηση σημειοσυνόλου και Τριγωνοποίηση Delaunay / διαγραμμα Voronoi.Θέματα Γεωμετρικής αναζήτησης, Δομές γεωμετρικών δεδομένων, Πλησιέστεροι γείτονες, Ομαδοποίηση.Επίσης, παρουσιάζονται θέματα υλοποίησης γεωμετρικών αλγορίθμων και χρήσης βιβλιοθηκών (π.χ. CGAL) για την ανάπτυξη γεωμετρικού λογισμικού σε γλώσσες όπως C/C++, και Python.",
        "id": 15100148
      },
    {
        "subjectName": "Υπολογιστική Θεωρία Μηχανικής Μάθησης",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "CS",
        "Professor": "Χρήστος Τζάμος",
        "Hours": 4,
        "Description": "-",
        "id": 15100814
      },
    {
        "subjectName": "Φωτονική",
        "semester": 8,
        "ECTS": 6,
        "Type": "Προαιρετικό",
        "Kateythinsi": "-",
        "Professor": "Γιώργος Κανέλλος",
        "Hours": 4,
        "Description": "Η φωτονική είναι προαιρετικό μάθημα του 8ου εξαμήνου σπουδών, που σκοπό έχει την περαιτέρω εξοικείωση και εμβάθυνση στην τεχνολογία οπτικών επικοινωνιών, καθώς και την εισαγωγή των φοιτητών σε σύγχρονες μεθόδους φωτονικής ολοκλήρωσης και επεξεργασίας του οπτικού σήματος. Μετά την εισαγωγή στις βασικές αρχές της φωτονικής τεχνολογίας, η ύλη του μαθήματος αναφέρεται στην μελέτη των φωτοπηγών laser και LED, συνεχίζει με τους οπικοηλεκτρονικούς διαμορφωτές και φωτοφωρατές που υλοποιούν τους πομπούς και δέκτες αντίστοιχα των τηλεπικοινωνιακών συστημάτων, αναφέρεται στην ολογραφία και τις εφαρμογές της και τέλος εισάγει τους φοιτητές στις τεχνολογίες αιχμής της φωτονικής ολοκλήρωσης και της αμιγώς οπτικής επεξεργασίας σήματος. Καλύπτεται έτσι μια ευρεία περιοχή βασικών και εξειδικευμένων οπτικοηλεκτρονικών τηλεπικοινωνιακών τεχνικών, και δίνεται η δυνατότητα στον/στην φοιτητή/τρια να παρακολουθήσει και να εμβαθύνει στις πιο σύγχρονες τεχνικές υλοποίησης τηλεπικοινωνιακών συστημάτων και οπτικής επεξεργασίας σήματος, έχοντας αποκτήσει ένα ικανοποιητικό γνωστικό υπόβαθρο ανάλυσης και σχεδιασμού αυτών των διατάξεων και συστημάτων.",
        "id": 15100436
      }

    ],


    
    "grades": [
      { 
        "id": 1,
        "semester": "Εξεταστική Σεπτεμβρίου 2022-2023",
        "classes": [
          { "name": "Γραμμική Άλγεβρα - 15100114", "grade": 8 },
          { "name": "Διακριτά Μαθηματικά - 15100010", "grade": 4 },
          { "name": "Ανάλυση Ι - 15100001", "grade": 6 }
        ]
      },
      { 
        "id": 2,
        "semester": "Εξεταστική Εαρινού 2022-2023",
        "classes": [
          { "name": "Ανάλυση Ι - 15100001", "grade": 2 },
          { "name": "Δομές Δεδομένων και Τεχνικές Προγραμματισμού - 15100088", "grade": 8 }
        ]
      },
      {
        "id": 3,
        "semester": "Εξεταστική Χειμερινού 2022-2023",
        "classes": [
          { "name": "Εισαγωγή στον Προγραμματισμός - 15100084", "grade": 7 },
          { "name": "Λογική Σχεδίαση - 15100430", "grade": 2 },
          { "name": "Διακριτά Μαθηματικά - 15100010", "grade": 3 }
        ]
      }
    ]
  }